[
  {
    "applyLink": "https://www.seek.com.au/job/76024704/apply",
    "description": "Our client provides highly specialised offensive cyber security initiatives for federal government agencies and private companies.\n \nThey focus on building bespoke software, reverse engineering, and vulnerability research.\n \nThe Opportunity\nThis is an opportunity for an experienced vulnerability researcher to work alongside people that have led in the intelligence and technology space for over 20 years. \n \nLeverage your knowledge and expertise to mission critical projects with the freedom to experiment and solve complex problems. \n \nThis role will further your career in an environment where cutting edge vulnerability research and capability development advances Australia’s national interests. \n \nThe Role\nIn this role you will be exposed to: \nOffensive cyber security projects\nReverse engineering\nVulnerability research \nExploit development \nDigital forensics  \nThe Ideal Person \nYou enjoy solving complex challenges and are not afraid to experiment with fresh ideas and new technologies on both digital and physical projects. \n \nWith +5 years in reverse engineering or with a relevant degree, you're skilled in spotting vulnerabilities in hardware and software and have experience in a defence, intelligence or related environment. \n \nYou're proficient in languages such as C++, Python, or Assembly, and know architectures x86 or ARM. You understand OS internals and network technologies. \n \nSalary / Rate\n$150k – $200k + Super \n \nHow to Apply\nTo apply online, please click on the appropriate link.\n \nAlternatively, for a confidential discussion, please contact \nMatthew Grohmann\n on \n02 6108 4878\n quoting ref no. \n19450\n \nHorizonOne is committed to building a diverse and inclusive workforce and we encourage applications from people of all cultures, capabilities and backgrounds.",
    "id": 76024704,
    "listingDate": "2024-05-21T02:30:05Z",
    "location": "Canberra",
    "title": "Vulnerability Researcher",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/76022276/apply",
    "description": "Our client provides highly specialised offensive cyber security initiatives for federal government agencies and private companies. \n \nThey focus on building bespoke software, reverse engineering, and vulnerability research. \n \nThe Opportunity\nThis is an opportunity to work alongside people that have led in the intelligence and technology space for over 20 years. \n \nLeverage your knowledge and expertise to mission critical projects with the freedom to experiment and solve complex problems. \n \nThis role will further your career in an environment where cutting edge vulnerability research and capability development advances Australia’s national interests.\n \nThe Role\nIn this role, you will be reporting directly to the CEO while receiving direct mentorship from senior team members.\n \nYou will:\nDesign, develop and maintain Python-based tools and scripts that aid in the analysis, penetration, and testing of security systems\nBreak down and reverse engineer complex systems, identifying vulnerabilities\nWork closely with a team of cyber security experts to execute projects that involve both digital and physical aspects of security \nThe Ideal Person\nYou have a tertiary degree in software engineering, with experience or an interest in reverse engineering. You have 5+ years of hands-on experience working with Python in a defence, intelligence or related environment. \n \nYou love creating innovative solutions that have real world impact. \n \nYou thrive in a small team of collaborative high performers as well as working autonomously. \n \nSalary / Rate\n$130k - $180k + Super (negotiable)\n \nHow to Apply\nTo apply online, please click on the appropriate link.\n \nAlternatively, for a confidential discussion, please contact \nMatthew Grohmann\n on \n02 6108 4878\n quoting ref no. \n19415\n \nHorizonOne is committed to building a diverse and inclusive workforce and we encourage applications from people of all cultures, capabilities, and backgrounds.",
    "id": 76022276,
    "listingDate": "2024-05-21T01:16:05Z",
    "location": "Canberra",
    "title": "Python Devleoper",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/76010704/apply",
    "description": "THE COMPANY\n\n\nAt Goterra, we believe climate change is the crisis of our time. We exist to help solve it. We are reimagining a future where nature and automation work in tandem to solve complex problems like reducing food waste and securing our food supply chain.\n\n\nWe are the change we want to see in the world. We strive and push as hard as we can for our economy and environment to reap the benefits of our dedicated research, relentless testing and state-of-the-art automated robotic infrastructure. At our headquarters in Hume, we design and build modular robotic infrastructure (MIB) that uses insects to process food waste into products - animal protein and high grade fertilizer.. \n\n\nOur diverse, multidisciplinary team has expertise in engineering, manufacturing, software, electronics, agriculture and biology, and work collaboratively to help make the world better, Billions of Tonnes Better.\n\n\nTHE POSITION\n\n\nWe are looking for an energetic, creative and hands-on Mechanical Design Engineer to join our growing Engineering team.\n\n\nThe successful candidate will be responsible for designing, developing, and testing mechanical systems and components and help us innovate with new designs and improve existing designs to fit our client needs.\n\n\nYou will be working together with a team of highly motivated engineers in an agile environment where we collaborate to solve complexed engineering initiatives.\n\n\nOn offer is a great working environment where people are respected and appreciated for their work. You can expect great work-life balance and flexibility with work, a competitive salary package, great career pathways and plenty of learning and growth opportunities.\n\n\nKey Responsibilities:\n\n\n\n\nDesign and develop mechanical systems and components, including 3D modeling, prototyping, and testing.\n\n\nContributing to the design iteration of our modular waste processing systems\n\n\nSpecifying and executing testing and analysis to ensure that our equipment performs at a high standard and according to customer requirements and product specification\n\n\nCollaborate with larger engineering team, product team and manufacturing team to ensure products are designed and built to specification\n\n\nDevelop and maintain technical documentation, including drawings, specifications, and test reports.\n\n\nParticipate in design reviews and provide feedback to improve designs and processes.\n\n\nTravel when needed for execution of testing and verification of design\n\n\nSupport selection and procurement of equipment\n\n\n\n\nKey Skills and Qualifications:\n\n\n\n\nBachelor's degree in Mechanical Engineering or related field.\n\n\n5+ years of experience in mechanical design and development.\n\n\nProficiency in 3D modeling software - preferably with Onshape but experience with Solidworks, Inventor and similar are all transferable\n\n\nExperience in project management and product development processes\n\n\nGood understanding of DFM principles (advantageous)\n\n\nStrong analytical and problem-solving skills\n\n\nExcellent communication and collaboration skills.\n\n\nAbility and availability to travel to various sites for testing and verification of designs\n\n\nFamiliarity with digital collaboration and communication tools such as Confluence/Notion/Slack/G suite will be beneficial\n\n\nA flexible and adaptable nature is required to survive in a fast moving and ever evolving start-up environment\n\n\nA strong ability to work autonomously and deliver on deadlines\n\n\n\n\nAdditional skills (not required but advantageous):\n\n\n\n\nExperience with machine component design \n\n\nExperience with HVAC design\n\n\nExperience with fluid dynamics\n\n\n\n\nWe look forward to receiving and reviewing your application!\n\n\nWe pride ourselves on being an inclusive organisation and encourage applications from anyone with passion for our mission, particularly from women, veterans, people with disability, the LGBTIQ+ community, and people from culturally and linguistically diverse backgrounds",
    "id": 76010704,
    "listingDate": "2024-05-20T10:31:12Z",
    "location": "Canberra",
    "title": "Mechanical Design Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75999046/apply",
    "description": "About Us \nRacing and Sports has operated successfully for over twenty years and listed on the Australian Stock Exchange in 2021 (RTH), raising capital to fund key investments to drive rapid growth through innovation, product diversification and international expansion. Racing and Sports are a leading global provider of technology solutions, data and analytics products, and digital and media services for the dynamic racing, sports and wagering industries globally. We are focused on providing targeted and high-quality solutions to our clients and working together to achieve a commercially advantageous outcome in every situation.\nBenefits of working with us\n• Be part of a dynamic and fast growing ASX listed global technology company, a rare opportunity in Canberra!\n• Join a passionate, diverse and friendly team who love what they do,\n• Chance to have a real impact on the business with increasing opportunities that grow as we do\n• Highly competitive remuneration, flexible work environment, birthday Leave and many more fantastic benefits available!\nThe Role \nThis position is responsible for the development and implementing functional programs, with a focus on mobile first web and cross platform mobile application development. You will work with other developers and product managers throughout the software development life cycle. Your goal will be to develop high-quality software that is aligned with user needs and business goals.\nThe position will also participate in design meetings and consulting with clients to refine, test and debug programs to meet business needs and interact and sometimes direct third-party partners in the achievement of business and technology initiatives. The person in this role will work closely with Development Team locally and internationally.\nThe key responsibilities of this role are:\n•\tDevelops information systems by designing, developing, and installing software solutions.\n•\tDetermines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n•\tFollow software development lifecycle.\n•\tDocument and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.\n•\tProtects operations by keeping information confidential. \n•\tknowledge of supporting web technologies, languages & frameworks.\n•\tAn understanding of the Information and Technology industry, as well as technology trends and next practice. \n•\tProven experience in developing and maintaining strong relationships across business and technology teams. \n•\tExperience in working in a competitive, fast paced industry.\nEssential Skills\n•\t\nExperience in data transmissions between wagering systems (e.g. ITSP) Integrated wagering data transmission to wagering operators via ITSP (Inter-Tote    \n        System Protocol) version 5.14+\n•\tExtensive experience in wagering communication protocols (ITSP)\n•\t3 plus years of experience in a similar role.\n•\tStrong knowledge of ASP.NET Core, Web API and C#\n•\tStrong front-end skills in Angular, Vue or similar\n•\tSQL experience in MSSQL or MySQLSD\n•\tAbility to write clean, easy to understand code.\n•\tOutstanding analytical and problem-solving capabilities.\n•\tExcellent written and verbal communication skills.\n•\tExperience with working in an agile environment\nDesirable Skills\n•\tSpeaking Tamil Language would be an advantage. \n•\tExperience with entity Framework or other ORM tools\n•\tCI/CD or DevOps\nSalary $90k-$100k (Based on Merit).For any questions, please email us on \n[email protected]\n.\nTo Apply\nIf this role is for you, hit the APPLY button now .The successful candidate must possess the right to work in Australia (fulltime rights) and be willing to undergo a Criminal Background Check as a pre-requisite to employment. Racing and Sports is an equal opportunity employer, whereby all qualified applicants will receive consideration for employment. Women and individuals from diverse backgrounds are encouraged to apply.\nApplications close 19 June 2024.",
    "id": 75999046,
    "listingDate": "2024-05-20T04:23:09Z",
    "location": "Canberra",
    "title": "Software Engineer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75961507/apply",
    "description": "About the company:\n\n\nSeeing Machines (SM) is the world leader in the field of Safety-AI and prides itself on developing technologies that save lives, for real!\n\n\nAround the globe and at any time of the day, there are almost 1 million cars on the roads that are using state-of-the-art operator monitoring technology developed by Seeing Machines which provides real-time protection from distraction and drowsy-related driving events. Seeing Machines works with the world’s leading brands (eg. General Motors, Mercedes Benz, Qantas, Caterpillar, Toll) across multiple transport sectors of automotive, commercial road transport (Fleet), and aviation to enhance safety.\n\n\nAbout The Role: \n\n\nThe Senior Machine Learning Scientist will work directly with internal stakeholders to develop occupant monitoring features using state-of-the-art machine learning methods (eg NN, CNNs, RNNs), traditional computer vision techniques, or often a combination of both. \n\n\nOne aspect of feature development includes collaborating with Human Factors Research Scientists and Data Acquisition Specialists to help collect relevant, truthed datasets. Also required is working closely with our Performance Analysis Team to ensure that we can measure and validate the performance of the algorithms.\n\n\nAbout The Algorithm Development Team:  \n\n\nSeeing Machines works with the world’s leading OEMs to deliver state-of-the-art operator monitoring technology across our chosen transport sectors of commercial road transport (Fleet), automotive, and aviation. In Fleet, our best-in-class aftermarket product Guardian provides drivers and fleet operators real-time protection from distraction and fatigue events. In automotive, we enable safer Advanced Driver Assistance Systems (ADAS) and Automated Driving (AD) solutions. In aviation, our advanced gaze tracking technology understands how pilots interact and monitor instruments – leading to better training and safer operations. \n\n\nThe Algorithm Development Team brings cutting edge research in areas such as fatigue and distraction detection into occupant monitoring solutions. Take an example of fatigue detection, which is conceptually simple – just detect when someone looks tired, right? To develop this feature, there are many underlying details that need to be understood. For example, how do you collect a dataset safely? What is the true drowsiness level? How to account for individual behavioural differences? Algorithm Development Team members work closely with Human Factors Research Scientists, Data Acquisition Specialists and Machine Intelligence Researchers in order to make progress on these kinds of questions in order to develop features.\n\n\nAside from developing new features, the Algorithm Development Team also helps improve existing features that are currently used by customers. For example, making improvements to handle specific real-world corner cases, improving performance, etc. \n\n\nAbout the role: \n\n\nDeveloping proof of concept algorithms and prototypes for features that will be continually evolving in Python and C++.\n\n\nTaking the technical lead on development of one or more algorithms.\n\n\nWriting clear documentation to help define features, including use cases, dataset specifications, performance targets, etc.\n\n\nMaking use of state-of-the-art machine learning techniques (eg NN, CNN, RNN) utilizing large datasets to train algorithms.\n\n\nProviding guidance to embedded software engineers to enable algorithms to be used on specific embedded hardware platforms.\n\n\nAssisting with business pursuit activities such as working with potential partners, assisting customers to evaluate our technology and fielding questions from customers.\n\n\nResponding to customer-reported issues when required in order to fix problems or limitations encountered in real-world conditions.\n\n\nEducational Qualification:\n\n\nA Masters or PhD (awarded or currently completing) in Computer Vision, Machine Learning, or equivalent industry experience\n\n\nEducational Experience:\n\n\nEssential \n\n\n3+ years of industry or postdoc experience.\n\n\nStrong theoretical understanding of machine learning concepts such as CNNs, RNNs, etc.\n\n\nExperience with machine learning frameworks such as TensorFlow, PyTorch or similar.\n\n\nExperience writing code in Python and/or C++, ideally in a commercial environment.\n\n\nEvidence of producing high-quality research outcomes and in disseminating effectively to academic and industry settings. \n\n\nDesirable \n\n\nUnderstanding of traditional computer vision and/or image processing techniques.\n\n\nExperience working on research in a commercial environment.\n\n\n\n\nExperience with practical data science or statistical analysis.\n\n\nExperience explaining and discussing technical topics with varied audiences. For example, talking with customers, internal engineers, or highly technical peers.\n\n\n\n\n\n\nPersonal attributes:\n\n\nAbility to communicate clearly and concisely to internal and external stakeholders.\n\n\nStrong computer literacy skills.\n\n\nWell-developed problem solving and critical thinking skills with the ability to collect, organise, analyse and disseminate significant amounts of information with attention to detail and accuracy.\n\n\nSound analysis and interpretation of data as evidenced through well written reports.\n\n\nDemonstrated time management skills as evidenced by the ability to meet tight timeframes and project deadlines.",
    "id": 75961507,
    "listingDate": "2024-05-17T05:19:06Z",
    "location": "Canberra",
    "title": "Senior Machine Learning Scientist",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75944738/apply",
    "description": "High Profile Federal Government Department!\nInitial 12 month contract with 2 x 12 month extension options!\nRewarding hourly rate! $$$$\nOne of Australia's leading Federal Government departments are looking to engage an \nRobotic Process Automation Developer\n to work as part of a highly motivated team. The successful \nRobotic Process Automation Developer\n will develop quality automation solutions, adhering to industry development best practice such as design sessions and code reviews. The successful \nRobotic Process Automation Developer\n will be offered an initial 12 month contract with 2 x 12 month extension options. \nThe successful \nRobotic Process Automation Developer\n will be responsible for, but not limited to: \nSetting up, testing and monitoring automated workflows \nMonitoring and maintaining automation post-implementation and resolving any potential issues \nProducing process documentation in order to outline mistakes and successes \nSupporting testers during Agile sprints and testing cycles by explaining requirements\nThe successful \nRobotic Process Automation Developer\n will have experience in the following:\nData integration skills and highly skilled in the use of data extraction and storage queries \nExperience developing automation solutions using the UiPath platform and the broader UiPath\nExperience in Agile software development and Proof of Technology projects\nDemonstrate strong problem-solving skills to lead or assist with debugging and testing phases\nThis is an amazing to join a leading Federal Government Agency and friendly team! The successful \nRobotic Process Automation Developer\n will be offered an \ninitial 12 month contract with 2 x 12 month extension options and receive a rewarding hourly rate!\n If you have the required skills and experience, APPLY NOW. Please forward your application to \n[email protected]\n quoting reference number \nST0050\n for more exciting job opportunities go to www.hitechaust.com",
    "id": 75944738,
    "listingDate": "2024-05-17T01:31:28Z",
    "location": "Canberra",
    "title": "Robotic Process Automation Developer / UiPath / SQL / Agile",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75935877/apply",
    "description": "Who We Are:\n\n\nNova Systems are the only wholly Australian owned Major Service Providers (MSPs) supporting Defence's Capability, Acquisition and Sustainment Group (CASG). We provide Australian sovereign capability to the Guided Weapons and Explosive Ordnance Delivery Division (GWEODD) who look after the acquisition and sustainment of a broad range of Explosive Ordnance (EO) capabilities for the Australian Defence Force. GWEODD currently manages thirty-eight acquisition projects and sustains over one thousand munition types (including thirty-five types of complex guided weapons). With the government announcements around increasing Sovereign Capability in Defence, we have opportunities for enthusiastic project managers to join our expanding team working to support GWEODD.\n\n\nAbout the role:\n\n\nAs a \nGuided Weapons Engineer\n working on GWEO projects you will be working alongside other guided weapons, explosive ordnance and armament projects personnel. Our preference would be for candidates that have prior Defence and/or Guided Weapons or Explosive Ordnance experience. \n\n\nWhat you may be involved in:\n \n\n\n\n\nDevelopment and review of engineering artifacts used to maintain and/or certify weapons, whilst complying with client engineering management systems,\n\n\nProviding specialist engineering consulting services to our clients in the area of guided weapons procurement\n\n\nWeapons integration and system sustainment\n\n\nCoordinating and managing technical outcomes within a professional engineering team\n\n\nDesign and compliance activities related to in-service management of explosive ordnance.\n\n\n\n\nWhat we would expect from you:\n \n\n\n\n\nAn Engineering degree in a suitable field and at least 2 years relevant experience, or a technical/trade background with 8+ years of demonstratable relevant Defence experience.\n\n\nRelevant experience in engineering artefact development and review activities.\n\n\nSufficient maturity to undertake independent design development and/or review; and\n\n\n\n\nDesirable skills:\n \n\n\n\n\nA demonstrably elevated level of professional knowledge on guided weapon systems, equipment, or technology.\n\n\nExperience working to support defence acquisition or sustainment projects.\n\n\nFamiliarityandconversance with some or all the following:\n\n\n\nGuided weapons / munitions,\n\n\nDefence technical regulatory frameworks (preferably Guided weapons / EO),\n\n\nExplosive ordnance, materiel management, technical management,\n\n\nCertification/integration activities, and EO / weapons-related Land, Sea, and Air operations experience\n\n\n\n\n\n\n\n\nLife at Nova:\n\n\nIn addition to salary, you are supported with:\n \n\n\n\n\nFlexible ways of working and dress for your day.\n\n\nCommitment to Professional and Personal Development.\n\n\nReward & Recognition Program offering exclusive discounts from hundreds of major retailers, helping you to save on groceries, petrol, holidays and more!\n\n\nAdditional Leave entitlements include Reserve Leave, Loyalty Leave, Parental Leave and Purchased Leave.\n\n\nWellbeing Hub with access to health and fitness content.\n\n\nEmployee Assistance Program for employees and family members.\n\n\nAccess to Defence Health and Travel Insurance.\n\n\nNova Employee Share Offer.\n\n\nAn inclusive and supportive culture.\n\n\nA range of other great benefits - just ask us!\n\n\n\n\nAPPLY NOW\n Alternatively for a confidential discussion, please contact \nPaul\n in the Nova Talent Acquisition Team on \n(08) 8252 7100\n. \n\n\nNova Systems does not accept any recruitment agency solicitation.\n \n\n\nNova Systems is committed to building a diverse and inclusive workplace, where everyone feels safe, valued, and included, where our people are our point of difference.",
    "id": 75935877,
    "listingDate": "2024-05-16T12:00:00Z",
    "location": "Canberra",
    "title": "Guided Weapons Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75922423/apply",
    "description": "The perfect match\nAAMC is a vehicle loss assessing company looking to utilise technology to radically improve the way our teams do their work, engage with clients and get people back in their cars fast. \nWe are seeking a creative thinker, ready to cut loose from the complex approval processes and hierarchies of the corporate world and let your sometimes quirky solutions be heard. If you’re a counter-intuitive thinker, even a misfit within normal structures but have boundless optimism while still being able to spot a problem before it happens and with a desire to make the world better (our world) then you will fit right in. \nYou might be working with people from anywhere in our business to design a solution one day, and the next you’ll be rolling up your sleeves to develop and test your ideas. Or you might need to extract the jumble of thoughts a group of not-so-tech savvy managers might have to convert into a set of instructions for external consultants. This role is as diverse as the people we employ and the organisations we work with, so if you like to work in a neat little box within a nice neat structure, this is probably not the role for you. We love those people too, that’s just not how we roll. \nWhile there are definitely some things we need you to know, we don’t expect you to know everything. A curious mind and a natural tendency for lifelong learning will get you a great big gold star. If you love learning that much, we will even help you scratch that itch by providing plenty of informal and formal learning opportunities if you so desire. \nDid we mention you can do all of this from the comfort of your own home full time? Nice hey! Commuting is a pain, so we’ve decided to just not do it. It also means you can live anywhere in the country as long as you have great internet speed. \nNow for the tech stuff.\n \nThe things we need you to know\nInformation security is definitely a big deal in our industry so you will ensure secure-by-design principles are followed, deliver documented technical specifications and be a whiz at ensuring solutions are robust while still being maintainable. \nOur perfect unicorn will have at least 2 years’ experience with the below.\nAzure resources such as: \nFunctions (with Python) \nService Bus \nLogic Apps \nKey Vault \nStorage accounts (Blob and SFTP) \nCosmos Db \nAzure Data Explorer \nAPI Management \nProgramming tools such as: \nDocker\nGitHub\nGithub Actions (with Terraform)\nVS Code\nJIRA and Confluence\n \nWAIT! \nDon’t close the advert if you don’t have all of this.  Unicorns are great but we’re also realists.  Maybe you have a lot of experience in some of these things and a little in others.  Or, maybe you have some experience across most of these things and absolutely none in a few that overall aren’t exactly showstoppers (looking at you JIRA and Confluence). Just send us an outline in your application of where your experience aligns with the above items, and we can work from there. \nWe’re not going to lie, this will be a busy role as you will be the only one of your kind in the team.  But it is a great team, full of supportive team members who like to problem solve together and pitch in and help when things get a bit hectic. We also have a great group of suppliers and consultants to provide expert advice, guidance and a helping hand to solve those extra tricky problems so you will never be left in some dark corner, all alone, to fend for yourself.\n \nIf this all sounds great\nIf you think this role has your name all over it, then APPLY! We’d love to hear from you.\nYour resume should address the general technical criteria outlined in this advertisement but we would love to see what you’re all about as a person in your cover letter. \nOnce we’ve read your info and realised you are a superstar, or a superstar in the making, we will be in contact to have a chat and provide you with a proper position description to really get down into the detail.\nFind us at: https://www.aamc.com.au/",
    "id": 75922423,
    "listingDate": "2024-05-16T04:56:25Z",
    "location": "Canberra",
    "title": "Azure Solution Architect/Developer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75918861/apply",
    "description": "The Role\nASD 6 Database Administrator: \nWithin the ICT Service Delivery function an ASD6 ICT Database Administrator is accountable under broad direction to perform and achieve complex database administration work within an integrated workforce. They are accountable to ensure they have knowledge of and compliance with legislative frameworks, government decision-making and ASD’s mission and policy requirements.\n \nAn ASD6 ICT Database Administrator will work independently with the opportunity for reasonable autonomy and accountability for the achievement of outcomes of their work. They will exercise both initiative and judgement in the interpretation of policy and in the application of practices and procedures. They will provide detailed database administration technical, professional and policy advice in relation to complex work and contribute to strategic planning, program and project management and policy development.\n \nAn ASD6 ICT Database Administrator may be a team coach or lead a team and be accountable to set work priorities and manage workflows. They are expected to be capable of building team capability through coaching, feedback and developing the quality of work undertaken by others within a work unit. They may exercise the associated people and financial responsibilities to achieve work unit outcomes.\n \nAn ASD6 ICT Database Administrator will have considerable level of stakeholder engagement and will liaise with stakeholders in relation to complex issues. They will be required to identify, anticipate and respond to stakeholders’ needs and expectations to achieve work unit and ASD outcomes. They will be accountable to contribute towards ongoing self-improvement and professional development.\n \nEL1 Database Administrator: \nWithin the ICT Service Delivery function an EL1 ICT Database Administrator is accountable under broad direction to perform and achieve very complex database management work within an integrated workforce. They will require an in-depth knowledge of and compliance with legislative frameworks, government decision-making and ASD’s mission and policy requirements.\n \nAn EL1 ICT Database Administrator will exercise a considerable degree of independence and perform subject matter expert role. They will exercise sound decision making and judgement to provide expert policy advice. They will have in-depth knowledge of the ICT service delivery function and are responsible for the development, implementation, compliance and review of policies and procedures relevant to their work within that function. They will engage in very complex problem solving and issues management and may coordinate and perform detailed or sensitive projects that impact on strategic, political or operational outcomes for ASD.\n \nAn EL1 ICT Database Administrator may be a team coach or lead a project or administrative team and will be accountable for the outcomes of the teams work and the appropriate use of resources to produce and achieve outcomes. They are expected to be capable of building team capability through coaching and feedback and reviewing and developing the quality of work undertaken by others within a work unit. They may exercise the associated people and financial responsibilities to achieve work unit outcomes.\n \nAn EL1 ICT Database Administrator will be responsible for actively managing key stakeholder relationships and will be required to identify relevant stakeholders’ expectations and concerns to develop and communicate methodologies and practices to achieve outcomes. They will be accountable to contribute towards ongoing self-improvement and professional development of their work area.\nAbout our Team\nThe Digital Workplace Services (DWS) section within Enterprise Technology Division is responsible for the delivery and support of corporate ICT platforms to ASD and its customers. This includes enterprise-scale collaboration tools, information and records management software, IT service management capabilities and a suite of developer enablement tooling.\n \nMore broadly, ASD is entering an exciting phase of growth, innovation and transformation. Our agency has committed to delivering \nREDSPICE\n, which is the most significant single investment in the Australian Signals Directorate’s 75 years.\n \nBeyond being part of a great team and having the opportunity to work across a range of technologies and challenges, ASD also provides benefits including:\nAn additional allowance of 4% on top of substantive salary which is superannuable\nPerformance-based pay increases\nInitiatives to recognise specific skills which may attract additional remuneration upon successful application.\nPositions that may attract Relocation Assistance.\nPromotion opportunities and pathways\nFlexible working arrangements\nGenerous support for training and development\n \nOur Ideal Candidate\nASD6 Database Administrator:\n The duties of an ASD6 ICT Database Administrator occupation in Defence include the following (note: not all duties are required to be performed during a 12-month performance cycle):\nManage database configuration including installing and upgrading software and maintaining relevant documentation.\nContribute to the setting of standards for database objects and ensuring conformance to these standards.\nApply data modelling, business analysis and SQL programming skills to create the correct scalability, functions and features of databases including data redundancy.\nUnderstand and use object model design concepts, particularly in relation to designing data structures, query SQL and reports.\nBuild and sustain effective working relationship with team members and actively participate in team work and group activities.\nFacilitate appropriate direction for the team by clearly communicating goals and objectives.\nEvaluate and optimise database performance and processes for compliance with Defence policy and procedures.\nDesign and implement solutions to issues impacting on the achievement of desired outcomes.\nAccountable to construct and follow project plans that have clear and appropriate milestones, goals, timeframes and budgets.\nUnderstand data modelling and contribute to the development of conceptual data models.\n \nEL1 Database Administrator:\n The duties of an EL1 ICT Database Administrator occupation in Defence include the following (note: not all duties are required to be performed during a 12-month performance cycle):\nManage database configuration including installing and upgrading software and maintaining relevant documentation.\nLead the development and implementation of strategies and the evaluation of business outcomes to ensure continuous improvement in the delivery of ICT database solution.\nExplain very complex information in relation to the development, use and operation of database management system tools and facilities.\nMaintain knowledge, experience and skills of database administration to provide advice to stakeholders and team members.\nBuild and sustain relationships, liaise with a range of stakeholders including other teams, peers and colleagues across Defence and other organisations.\nMotivate and mentor teams, aligning complementary skills and allocating resources in a manner that delivers results.\nEvaluate projects to understand critical factors for success and engage in activities toachieve continuous improvement.\n Analyse very complex database types and database structures and apply expertise to identify and recommend courses of action.\nAccountable to set strategy for effective use of database technology taking into account the complex interrelations between hardware and software.\nManage database configuration including installing and upgrading software and maintaining relevant documentation.\n \nASD is seeking applicants to fill current and anticipated vacancies and to create a merit pool for future vacancies.\nApplication Closing Date: Sunday 2 June 2024\n \nFor further information please review the job information pack, reference \nASD/04378/24 \non https://www.asd.gov.au/careers.",
    "id": 75918861,
    "listingDate": "2024-05-16T03:30:22Z",
    "location": "Canberra",
    "title": "ASD6 & EL1 Database Administrator",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75918836/apply",
    "description": "The Role\nThe Digital Workplace Services (DWS) section within Enterprise Technology Division is responsible for the delivery and support of corporate ICT platforms to ASD and its customers. This includes enterprise-scale collaboration tools, information and records management software, IT service management capabilities and a suite of developer enablement tooling.\nDWS is seeking highly motivated and experienced Enterprise Application Administrators to lead the technical evolution of some of ASD’s most critical computer systems, through the oversight of day-to-day operations of its corporate ICT environments. For DWS, platforms we support include, but are not limited to:\nAtlassian Cloud and Data Center Bitbucket, Confluence, Crowd and Jira\nElastic Stack (Elasticsearch, Logstash, Kibana, Beats)\nJFrog Artifactory\nMicrosoft M365 for Enterprise\nMicrosoft SharePoint Server, SQL Server and System Centre Service Manager\nOpenText Content Manager (Formerly TRIM / Records Manager)\nTotara Learning Management System\nAnd many other Open Source, Commercial and Government-off-the-shelf enterprise capabilities.\nAll of DWS’s Infrastructure-as-a-service (IaaS) applications are hosted on a mix of Windows Server and Red Hat Enterprise Linux virtual servers, and in some instance are containerised using Docker or Kubernetes, so experience with one, some or all of these technologies will be extremely beneficial. DWS also supports capability hosted in Azure and Amazon Web Services (AWS), so experience with one or both of these cloud platforms with also be extremely beneficial\nAbout our Team\nASD is entering an exciting phase of growth, innovation and transformation. Our agency has committed to delivering \nREDSPICE\n, which is the most significant single investment in the Australian Signals Directorate’s 75 years.\nBeyond being part of a great team and having the opportunity to work across a range of technologies and challenges, ASD also provides benefits including:\nAn additional allowance of 4% on top of substantive salary which is superannuable\nPerformance-based pay increases\nInitiatives to recognise specific skills which may attract additional remuneration upon successful application.\nPositions that may attract Relocation Assistance.\nPromotion opportunities and pathways\nFlexible working arrangements\nGenerous support for training and development\nOur Ideal Candidate\nOur ideal candidates for the ASD 6 and EL1 Enterprise Application Administrators will have broad experience in supporting the front and back end of enterprise applications, with EL1 candidates demonstrating subject matter expertise in one or more of the platforms listed in “About this Role” and has strong stakeholder management experience. Our ideal candidates will also have broad experience supporting Windows Server and/or Red Hat Enterprise Linux virtual servers in support of the hosted enterprise applications.\nOur ideal candidates will bring new ideas to the table, based on their experience supporting enterprise platforms in previous roles, improving the way our teams do business and improving the overall quality of service we provide to our customers. Our ideal candidates will also have a strong willingness to learn new technologies to assist in supporting existing platforms and expand their own skillsets.\nOur ideal candidates will be good team players, willing to help others in the team to solve problems, be collaborative by sharing their ideas and knowledge with team members, clients and stakeholders and be open to feedback from others. Our ideal candidates will also have an ability to think critically and apply their technical expertise to unconventional situations.\n \nASD is seeking applicants to fill current and anticipated vacancies and to create a merit pool for future vacancies.\n \nApplication Closing Date: Sunday 2 June 2024\n \nFor further information please review the job information pack, reference \nASD/04438/24 \non https://www.asd.gov.au/careers",
    "id": 75918836,
    "listingDate": "2024-05-16T03:30:09Z",
    "location": "Canberra",
    "title": "ASD6 & EL1 Enterprise Application Administrator",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75918690/apply",
    "description": "The Role\nASD has a wide variety of Software Developer roles on offer. These roles offer exciting, challenging and interesting work across all groups in ASD. We are seeking people who want to be at the forefront of innovation and want to work alongside experts in a wide variety of fields.\nWe are seeking applicants with a range of experience – from graduates to seasoned professionals – who are motivated to develop and learn new skills, work collaboratively to solve complex and interesting problems, and contribute to capabilities that have real-world impact.\nASD’s software developers typically work in multi-disciplinary teams responsible for the design and development of capabilities that meet ASD’s mission needs. Activities may include, but are not limited to:\nIdentifying, creating and applying software development and security standards\nPlanning and designing software components\nEstimating time and effort required for software development, constructing, amending and verifying software components\nApplying test-driven development and ensuring appropriate test coverage\nUsing peer review techniques – such as programming documenting software components\nUnderstanding and obtaining agreement to the value of the software components to be developed\nSelecting appropriate development methods and life cycles; applying recovery techniques to ensure the software being developed is not lost\nImplementing appropriate change control to software development practices.\nResolving operational problems with software and fixing bugs.\nDepending on requirements and the characteristics of the project or assigned work – software development methods and life cycles can be predictive (plan-driven_ approaches or adaptive (iterative/agile) approaches.\nKey Duties: \nASD 6 Software Developer \nAccountable for designing, coding, testing, reviewing, correcting and documenting large or complex programs and program modifications according to supplied specifications, standards and tools.\nAccountable for accurate completion of work to agreed quality standards, share own expertise with others and guide and mentor less experienced employees.\nDevelop specialist knowledge of domain technologies and advise on their application.\nUtilise knowledge and experience in development technologies to contribute to continuous process improvement.\nBuild and sustain effective relationship with team members and actively participate in team work and group activities.\nWork collaboratively with stakeholders and subject matter experts to progress ICT software engineering business activities.\nDesign and implement solutions to issues impacting on the achievement of desired outcomes.\nEvaluate activities and processes for compliance with ICT software development standards and processes.\nASD EL 1 Software Developer \nAccountable for designing, coding, testing, correcting, reviewing, documenting and releasing large or very complex programs and program modifications according to supplied specifications, standards and tools.\nAccountable for accurate completion of work within timeframes and quality requirements, share own expertise with others and guide and mentor less experienced employees.\nHas expertise in domain technologies and generate new concepts within that domain.\nUtilise knowledge and experience to consider ramifications of issues and longer term impact of own work and work area to meet business objectives.\nWork collaboratively with stakeholders and other subject matter experts to progress ICT software engineering business activities.\nMotivate and mentor teams, aligning complementary skills and allocate resources in a manner that delivers results.\nAnalyse very complex ICT software engineering issues, applying expertise to identify and implement courses of action.\nAssess and evaluate software development strategy, initiatives, projects, policy and procedures.\nAbout our Team\nASD is entering an exciting phase of growth, innovation and transformation. Our agency has committed to delivering \nREDSPICE\n, which is the most significant single investment in the Australian Signals Directorate’s 75 years.\nWould you like to develop, build and deliver world class software to protect Australia and its national interests? \nCan you be counted on to find innovative, clever solutions and develop your skills to become a well-rounded software developer? \nAre you interested in enhancing and modernizing existing capabilities?\nIf you answer yes to any of the above questions, keep reading, we want your skills!\nOur Ideal Candidate\nASD is looking for experienced software developers who are highly proactive and creative in nature to:\nEngage and communicate with stakeholders to identify, respond and provide advice on issues to achieve work unit outcomes. \nProvide advice, guidance and expertise to promote adoption of methods and tools and adhere to security policies, and development benchmark and standards.\nShare information, monitor work practices, set work priorities and develop local procedures.\nConducts peer review of code and development task against quality standards.\nDocuments and shares lessons leant on software development, configuration, management and integrations.\nASD is seeking applicants to fill current and anticipated vacancies and to create a merit pool for future vacancies.\n \nApplication Closing Date: Sunday 2 June 2024\n \nFor further information please review the job information pack, reference \nASD/04441/24 \non \nhttps://www.asd.gov.au/careers\n.",
    "id": 75918690,
    "listingDate": "2024-05-16T03:28:30Z",
    "location": "Canberra",
    "title": "ASD 6 & EL1 Software Developer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75918636/apply",
    "description": "The Role\nASD has a wide variety of Software Developer roles on offer. These roles offer exciting, challenging and interesting work across all groups in ASD. We are seeking people who want to be at the forefront of innovation and want to work alongside experts in a wide variety of fields.\nWe are seeking applicants with a range of experience – from graduates to seasoned professionals – who are motivated to develop and learn new skills, work collaboratively to solve complex and interesting problems, and contribute to capabilities that have real-world impact.\nASD’s software developers typically work in multi-disciplinary teams responsible for the design and development of capabilities that meet ASD’s mission needs. Activities may include, but are not limited to:\nIdentifying, creating and applying software development and security standards\nPlanning and designing software components\nEstimating time and effort required for software development, constructing, amending and verifying software components\nApplying test-driven development and ensuring appropriate test coverage\nUsing peer review techniques – such as programming documenting software components\nUnderstanding and obtaining agreement to the value of the software components to be developed\nSelecting appropriate development methods and life cycles; applying recovery techniques to ensure the software being developed is not lost\nImplementing appropriate change control to software development practices.\nResolving operational problems with software and fixing bugs.\nDepending on requirements and the characteristics of the project or assigned work – software development methods and life cycles can be predictive (plan-driven_ approaches or adaptive (iterative/agile) approaches.  \nKey Duties: \nASD 4 Software Developer \nPerform coding, testing, reviewing, correcting and documenting of moderately complex programs and program modifications using supplied specifications, standards and tools.\nContribute to the work of the team and continuous improvement.\nAcquire and apply knowledge of intermediate domain technologies.\nAcquire and apply knowledge of relevant development technologies.\nBuild and sustain effective relationships with team members and actively participate in team work and group activities.\nListen to internal and external stakeholders to meets needs and expectations.\nRecommend solutions to issues impacting on the achievement of desired outcomes.\nASD 5 Software Developer \nPerform coding, testing, reviewing, correcting, and documenting of moderately complex programs and program modifications using supplied specifications, standards and tools.\nContribute to the work of the team and continuous improvement.\nAcquire and apply knowledge of advanced domain technologies.\nAcquire and apply knowledge and experience in development technologies.\nBuild and sustain effective working relationships with team members and actively participate in team work and group activities.\nEngage with relevant stakeholders and understand their expectations and concerns.\nCollate options and recommend a solution to issues impacting on the achievement of desired outcomes.\nSeek advice and guidance on more complex activities.\n \nAbout our Team\nASD is entering an exciting phase of growth, innovation and transformation. Our agency has committed to delivering \nREDSPICE\n, which is the most significant single investment in the Australian Signals Directorate’s 75 years.\nWould you like to develop, build and deliver world class software to protect Australia and its national interests? \nCan you be counted on to find innovative, clever solutions and develop your skills to become a well-rounded software developer? \n Are you interested in enhancing and modernizing existing capabilities?\nIf you answer yes to any of the above questions, keep reading, we want your skills!\nOur Ideal Candidate\nASD is looking for experienced software developers who are highly proactive and creative in nature to:\nEngage and communicate with stakeholders to identify, respond and provide advice on issues to achieve work unit outcomes. \nProvide advice, guidance and expertise to promote adoption of methods and tools and adhere to security policies, and development benchmark and standards.\nShare information, monitor work practices, set work priorities and develop local procedures.\nConducts peer review of code and development task against quality standards.\nDocuments and shares lessons leant on software development, configuration, management and integrations.\nASD is seeking applicants to fill current and anticipated vacancies and to create a merit pool for future vacancies.\n \nApplication Closing Date: Sunday 2 June 2024\n \nFor further information please review the job information pack, reference \nASD/04451/24 \non https://www.asd.gov.au/careers",
    "id": 75918636,
    "listingDate": "2024-05-16T03:27:48Z",
    "location": "Canberra",
    "title": "ASD 4 & 5 Software Developer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75918526/apply",
    "description": "The Role\nASD is seeking highly motivated Systems Engineers from all backgrounds with experience in various forms of ICT Engineering to deliver systems that enable the conduct of intelligence, cyber security and offensive cyber operations in support of the Australian Government and Australian Defence Force (ADF). \nAs an ASD6 Systems Engineer, you will be responsible for working across the systems engineering process from requirements to design to development to testing, delivery and sustainment. You will work in multi-disciplinary teams delivering systems using technologies from RF and wired communications to networking to computing and software systems. The systems will range from small scale, bespoke solutions to some of the largest scale, complex enterprise systems in Australia. \nFurther information can be found at: \nI’m changing my career | Australian Signals Directorate (asd.gov.au)\n \nASD6 Systems Engineer: \nWork independently with the opportunity for reasonable autonomy and accountability for the achievement of outcomes of their work.\nLead a team, allocate work, resources and tasks, set work area priorities, develop strategies and evaluate business outcomes.\nPerform critical and complex engineering activities and provide advice in the field of systems engineering under limited direction.\n Apply engineering knowledge and experience to identify risks and uncertainties and consider these in planning, decision-making and priority setting.\nAssess technical and design packages including scoping, planning, reviewing, provide recommendations and contribute to the implementation of actions.\nAbout our Team\nASD is entering an exciting phase of growth, innovation and transformation. Our agency has committed to delivering \nREDSPICE\n, which is the most significant single investment in the Australian Signals Directorate’s 75 years.\nOur Ideal Candidate\nOur Ideal candidate should possess one or more of the following traits and skills for a Senior Systems Engineer:\nIndustry experience, formal training or a particular domain expertise\nThe ability to design, build and administer systems according to the high standard expected throughout ASD and in accordance to industry protocols\nThe ability to tailor your communication style to effectively engage various audiences\nThe ability to be work flexibly and both independently and within the team.\nHave the capacity and discipline to build and manage systems in accordance with our high standards.\nHave some experience in producing formal systems engineering documentation.\n \nASD is seeking applicants to fill current and anticipated vacancies and to create a merit pool for future vacancies\n \nApplication Closing Date: Sunday 2 June 2024\n \nFor further information please review the job information pack, reference \nASD/04459/24 \non https://www.asd.gov.au/careers.",
    "id": 75918526,
    "listingDate": "2024-05-16T03:26:25Z",
    "location": "Canberra",
    "title": "ASD 6 Systems Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75918059/apply",
    "description": "The Role\nASD is seeking highly motivated Systems Engineers from all backgrounds with experience in various forms of ICT Engineering to deliver systems that enable the conduct of intelligence, cyber security and offensive cyber operations in support of the Australian Government and Australian Defence Force (ADF). \nASD is recruiting for ASD4 and ASD5 Systems Engineers. You will be responsible for working across the systems engineering process from requirements to design to development to testing, delivery and sustainment. You will work in multi-disciplinary teams delivering systems using technologies from RF and wired communications to networking to computing and software systems. The systems will range from small scale, bespoke solutions to some of the largest scale, complex enterprise systems in Australia. \nFurther information can be found at: \nI’m changing my career | Australian Signals Directorate (asd.gov.au)\nASD4 Systems Engineer: \nAccountable under routine direction to perform and achieve moderately complex systems engineering work within an integrated workforce.\nAccountable for organising their workflow and seeking advice where required to make decisions relating to their area of responsibility.\nApply technical engineering knowledge and experience, understand priorities to research, define issues, and suggest corrective actions.\nUndertake technical research and analysis, conduct reviews, assessments and perform procedural or operational support work to achieve results.\nASD5 Systems Engineer: \nAccountable under limited direction to perform and achieve complex systems engineering work within an integrated workforce.\nAccountable for organising their workflow and making independent decisions relating to their area of responsibility.\nAccountable for exercising assigned engineering authorities and any Technical Regulatory Authority delegations.\nApply technical engineering knowledge and experience, understand priorities to research, define issues, and implement corrective actions.\nAssess technical and design packages including scoping, planning, reviewing and provide recommendations for consideration.\nAbout our Team\nASD is entering an exciting phase of growth, innovation and transformation. Our agency has committed to delivering \nREDSPICE\n, which is the most significant single investment in the Australian Signals Directorate’s 75 years.\nOur Ideal Candidate\nOur Ideal candidate should possess one or more of the following traits and skills for Systems Engineer:\nIndustry experience, formal training or a particular domain expertise\nThe ability to design, build and administer systems according to the high standard expected throughout ASD and in accordance to industry protocols\nThe ability to tailor your communication style to effectively engage various audiences\nThe ability to be work flexibly and both independently and within the team.\nHave the capacity and discipline to build and manage systems in accordance with our high standards.\nHave some experience in producing formal systems engineering documentation.\n \nASD is seeking applicants to fill current and anticipated vacancies and to create a merit pool for future vacancies.\n \nApplication Closing Date: Sunday 2 June 2024\n \nFor further information please review the job information pack, reference \nASD/04444/24 \non https://www.asd.gov.au/careers",
    "id": 75918059,
    "listingDate": "2024-05-16T03:15:10Z",
    "location": "Canberra",
    "title": "ASD 4 & 5 Systems Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75917062/apply",
    "description": "Electro Optic Systems (EOS) is an ASX listed Australian technology company operating in the defence and aerospace markets.  Our products incorporate advanced electro-optic applications based on EOS core technologies in software, laser, electronics, optronics, gimbals, telescopes and beam directors, and precision mechanisms.  With our headquarters in Canberra and a growing global workforce, we are experiencing exponential growth and are placed to become Australia's leading defence and aerospace exporter.\n\n\nThe defence business develops and produces remotely controlled weapon systems and ancillary products.  These systems are adaptable to suit potential customer weapon inventories and comprise state-of-the-art gimbal mounts, fire control systems and world-class sensor units.  We continually strive to help our people achieve personal goals, engaging them in challenging and inspiring projects that shape our future.\n\n\nBenefits\n \n\n\n\n\nStructured friendly and supportive team  \n\n\nLearning and development opportunities  \n\n\nOpportunities for further career development \n\n\nFree Parking \n\n\nPaid parental leave \n\n\nEOS is an Equal Opportunity Employer.\n\n\n\n\nAbout the role\n\n\nThe Software Engineer is a specialist within EOS Defence Systems (EOS DS) and is responsible for applying routine systematic approaches in a team-based environment to solve problems using disciplined engineering techniques (e.g. software, mechanical, electronics, system, testing etc). The role is also responsible for applying knowledge to the development of products and designs that support the product development and product goals of EOSDS. \n\n\nIn this role you will:\n\n\n\n\nApply software designs for new and existing products that satisfy defined requirements within specified time frames. \n\n\nApply software analyses in support of product development activities. \n\n\nWork with mechanical, electronics, and System Engineers to ensure that the design produced satisfies the defined requirements. \n\n\nApply software engineering practices including carrying out developer testing, documenting code, participating in code reviews etc. \n\n\nApply test and evaluation activities on software to verify and sign-off of all design requirements.\n\n\nPrepare and maintain design documentation including requirements, software architecture, detailed design, configuration records, test plans and test reports to support designs.\n\n\nWork with Project Engineers to ensure design solutions are delivered on time and on budget and meet other project requirements. \n\n\nDocument the design, safety requirements, and system specifications and prepare for senior review and quality assurance.\n\n\nSupport integration activities with customers and partners. \n\n\nDesign the routine elements that are required for baselining, modification, enhancement of engineering solutions. \n\n\nApply a systematic approach to configure the system to be built and provide input and assurance of the Engineering and Production Bill of Materials (BOM) to the appropriate standard of system and technical readiness. \n\n\nWork closely with other engineering disciplines to ensure cohesive and complete system designs. \n\n\nAdhere to and ensure understanding and compliance with company procedures to achieve a safe and secure work environment.\n\n\n\n\nAbout You\n\n\nSoftware Engineers exercise engineering technical knowledge within or across specialist disciplines and the ability to work under general direction to apply strategic alignment. Adherence to governance and standards and interacting with people in cross functional teams to achieve business outcomes with the appropriate levels of integrity, safety, and ethics of these designs is critical to the role.\n\n\nYou need to be ethical, influencer and problem solver who works and interacts with people in cross functional multidisciplinary teams to solve routine engineering problems and solutions. \n\n\n \n\n\nExperience: \n\n\n\n\nMinimum 3 years’ experience in a similar role, preferably in a product development environment. Ability to work independently with limited supervision \n\n\nStrong knowledge of C/C++, or Java \n\n\nA collaborative mindset, with excellent communication skills and a passion and aptitude for problem solving.\n\n\nAn ability to apply engineering practices with experience across the engineering lifecycle through concept development, design, integration, test, sustainment and delivery. \n\n\nExperience with multi-disciplinary teams in a structured product development or project engineering environment is desirable. \n\n\nExperience in Defence sector desirable. \n\n\n\n\nQualifications: \n\n\n\n\nBachelor’s Degree in software engineering or similar discipline. \n\n\nPostgraduate qualifications in Engineering are desirable.\n\n\n\n\nHow to Apply\n\n\nIf you are willing to take on a challenge and want to contribute to a proud Australian company that is growing rapidly then we would like to hear from you. Please apply now with your resume and a covering letter outlining your experience and why you believe you are the right fit for our organisation.\n\n\nWe will review, short-list and conduct interviews for this role prior to the closing date. We encourage the submission of early applications.\n\n\nCandidates must be Australian Citizens or have Permanent Working Rights. \n\n\nTo learn more about EOS and what employment opportunities we provide, please visit: www.eos-aus.co",
    "id": 75917062,
    "listingDate": "2024-05-16T02:56:22Z",
    "location": "Canberra",
    "title": "Software Design Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75913744/apply",
    "description": "Our Why\n \nDatacom works with organisations and communities across Australia and New Zealand to make a difference in people’s lives and help organisations use the power of tech to innovate and grow. \nThe Nuts and Bolts\nWe have over 6,500 people across our offices, and generate an annual revenue of over $1.49 billion, this makes us one of Australasia's largest professional IT services companies. We have extensive expertise in operating data centres, providing IT services, software engineering and application management, as well as payroll and customer service design and operations. With this comes a long list of significant clients Datacom is committed to hiring, developing and promoting the best talent from a diverse range of backgrounds. We are local at heart, yet world-class in capability.\nAbout the role\nThe M365 Consultant plays a key role as a professional services team member of our Microsoft 365 Centre of Excellence. As a member of this team, you will be responsible for designing, building and supporting solutions end to end for our customers. You will troubleshoot technical issues for customers. You will be accountable for delivering a first-class experience for consumers of our Intelligent Workplace services. You will be responsible for providing guidance, advisory and project delivery to customers using best practice and modern technology approaches. This is an opportunity to work in a fast paced, dynamic environment with an enthusiastic team of professionals. \nAs we are a national team and applications from all Australian geographies will be considered.\nWhat you'll do\nAs a M365 Consultant you will focus on: \n \nAnalyse business requirements developing project documentation including solution designs documents, recommendation reports and systems as-built. \n \nFacilitate customer workshops and presentations providing thought leadership.\n \nProvide technical leadership for customers Microsoft 365 environments and solutions.\n \nBuild and deploy solutions within Microsoft 365 platform, including SharePoint Online, Microsoft Teams, Power Automate and Power Apps.\n \nLead and execute Microsoft 365 migration projects. Migrating information from legacy systems into SharePoint Online, OneDrive, Microsoft Teams, Power Automate and Power Apps.\n \nFacilitate training workshops. Develop training materials. \n \nFollow best practice methodologies and adhere to recognised ITIL processes (EG: Change/release)\n \nProvide governance and support to customers Microsoft 365 environments.\n \nWhat you’ll bring\n:\n \nPrevious experience in an ICT Professional Services organisation as a Microsoft 365 Consultant.\n \nExperience designing, building and deploying SharePoint Online, MS Teams and Power Platform solutions.\n \nExperience migrating content into Microsoft 365.\n \nStrong presentation skills. \n \nExperience running workshops.\n \nAbility to address complex business problems with M365 based solutions.\n \nExperience designing and implementing enterprise information architecture.\n \nStrong analytical and problem-solving skills.\n \nExperience developing Power Automate workflows and Power Apps.\n \nExcellent documentation and communication skills.\n \nExtensive knowledge of core collaboration services in M365; SharePoint Online, MS Teams and OneDrive.\n \nExperience developing PowerShell scripts.\n \nNice to have\n \nExperience developing custom solutions using SharePoint Framework (SPFx), JavaScript, C#, and HTML/CSS.\n \nExperience with Information management and Information protection (Microsoft Purview).\n \nExperience building custom integrations.\n \nExperience using AvePoint and Nintex.\n \nIf this sounds like your next career adventure, we would be delighted to receive your application. Apply now - we can’t wait to meet you!\nWhy Datacom?\nDatacom is one of the largest suppliers of Information Technology professional services in New Zealand and Australia. As an ANZ company, we have managed to maintain a dynamic, agile, small business feel that is often diluted in larger organisations of our size. It's our people that give us our unique culture and energy that you can feel from the moment you meet with us.\nAt Datacom, you'll be recognized and valued for your contributions. We're growing year on year and can provide career opportunity in a collegial and agile environment that empowers people and promotes innovation. We care about our people and provide a range of perks such as health insurance, employee discounts, social events, remote working, flexi-hours, and professional development courses to name a few. We operate at the leading edge of technology to help our largest enterprise organisations explore possibilities and solve their biggest challenges, so you will never run out of interesting new challenges and opportunities.\nIf you would like to know more and this sounds like you. Please apply online today!",
    "id": 75913744,
    "listingDate": "2024-05-16T01:14:55Z",
    "location": "Canberra",
    "title": "M365 Consultant - Canberra",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75864627/apply",
    "description": "Company Description\n\n\nARQ, Dialog, CatapultBI, ICEMEDIA, Eighty20, Riley and AccessHQ are now all part of NCS Australia.\nAbout us: \nWe are NCS Australia! We have brought together Australia’s best tech talent, working as one to harness technology and advance our communities, to make the extraordinary happen.\nWe're proud of our rich history of partnering with our clients to develop end to end digital technology solutions to accelerate their transformation and innovation journey. For over 40+ years our diverse global teams have delivered large-scale, mission-critical, multi-platform projects to governments and enterprises.\n\n\nJob Description\n\n\nAs a Full Stack Developer, you will join our Canberra professional consulting team. You will bring enterprise experience in delivering high level technical solutions. You will develop front end website architecture and back-end website applications and create servers and databases for functionality.\nYou will provide application design, user interactions and full stack development services, collaborating and working as part of a team to design, develop and enhance bespoke applications followed by deploying them on Azure. You will be working along side graphic designers for web design features.\nYou will be utilizing Microsoft's .NET infrastructure to create software solutions that meet clients' requirements. You will be reformulating existing code to ensure adherence to stipulated guidelines.\nOn a daily basis you will be testing your outputs to ensure that they are in excellent working order. Moreover, you will be deploying developments and monitoring uptake by the target audience and  will use clients' feedback to inform the creation of subsequent versions of each development.\nOn offer is an exciting career where you'll make an impact and work with innovative technology solutions. You'll perfect your skills alongside a talented and collaborative team while enjoying the recognition, progression and extensive benefits of a global organisation. \n\n\nQualifications\n\n\nMinimum 5+ years' experience in developing complex project solutions using C#, SQL,.NET 3.5, 4.X and .NET Core, Web API etc.\n3+ years of SQL Server development experience, including performance analysis, tuning and troubleshooting.\nExperience in front-end frameworks like VueJS, HTML 5, CSS3 and TypeScript is nice to have\nSolid hands-on experience on CI/CD pipeline and DevOps Tools (Microsoft Azure)\nExperience working as part of a Scrum Agile team\nExperience working with ETL tools such as FME is nice to have\nExperience in analysing, design, develop, as well as implementing RESTful services and APIs. \nExperience performing on-going security testing and code review to improve software security.  \nStrong commitment to testing and software quality assurance.   \nExperienced building and operating highly scalable, available, performant & secure solutions.\n\n\nAdditional Information\n\n\nWhy join us: \nAt NCS Australia, you'll be part of a team that values your growth and development. Our comprehensive global learning and development program will equip you with the skills and knowledge needed to succeed. Plus, you'll be mentored by some of the industry's best, and have access to a worldwide network of career opportunities. Join us now and discover just how far your career can go!\nWe are in the process of refreshing our employee benefits, so don’t forget to ask our Talent Acquisition Team about what’s on offer. \nWe take pride in our commitment to valuing and supporting our people and the communities we serve. Diversity, inclusivity, and being different are not just buzzwords for us - they are integral to our culture. We are dedicated to upholding Equal Employment Opportunity Principles and providing reasonable accommodations to all our applicants. If you require any assistance or modifications to navigate our careers site or complete your application, please don't hesitate to reach out to us at \n[email protected]\n\">\n[email protected]\n.\nOther important stuff: \nTo be eligible for a position with us, applicants will need to have valid work rights for Australia and be willing to undergo a comprehensive background checking process, including probity and police checks.\nAs we navigate through our business integration process, we will continue to issue contracts under our existing entities of ARQ, Dialog, CatapultBI, ICEMEDIA, Eighty20, Riley or AccessHQ.\nVisit our website https://www.ncs.co/en-au/ for more information.\nAgencies:\n We’ve got this. We request that you do not contact NCS employees outside of the Talent Acquisition team. NCS exclusively accepts resumes from agencies on our preferred supplier panel through the NCS Agency Portal. Agencies that submit resumes must have a valid fee agreement and be assigned to the particular requisition by the Talent Acquisition team. Any resumes that are submitted outside of this process will become the sole property of NCS. If a candidate is hired outside of this process, no fee or payment will be given.\nWhy join us:\nAt NCS Australia, you'll be part of a team that values your growth and development. Our comprehensive global learning and development program will equip you with the skills and knowledge needed to succeed. Plus, you'll be mentored by some of the industry's best, and have access to a worldwide network of career opportunities. Join us now and discover just how far your career can go!.\nWe are in the process of refreshing our employee benefits, so don’t forget to ask our Talent Acquisition Team about what’s on offer. \nWe take pride in our commitment to valuing and supporting our people and the communities we serve. Diversity, inclusivity, and being different are not just buzzwords for us - they are integral to our culture. We are dedicated to upholding Equal Employment Opportunity Principles and providing reasonable accommodations to all our applicants. If you require any assistance or modifications to navigate our careers site or complete your application, please don't hesitate to reach out to us at \n[email protected]\n.\nOther important stuff: \nTo be eligible for a position with us, applicants will need to have valid work rights for Australia and be willing to undergo a comprehensive background checking process, including probity and police checks.\nAs we navigate through our business integration process, we will continue to issue contracts under our existing entities of ARQ, Dialog, CatapultBI, ICEMEDIA, Eighty20, Riley or Access HQ.\nAgencies:\nWe’ve got this. We request that you do not contact NCS employees outside of the Talent Acquisition team. NCS exclusively accepts resumes from agencies on our preferred supplier panel through the NCS Agency Portal. Agencies that submit resumes must have a valid fee agreement and be assigned to the particular requisition by the Talent Acquisition team. Any resumes that are submitted outside of this process will become the sole property of NCS. If a candidate is hired outside of this process, no fee or payment will be given.",
    "id": 75864627,
    "listingDate": "2024-05-15T06:06:52Z",
    "location": "Canberra",
    "title": "Senior Full Stack Engineer- .Net/Azure",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75848400/apply",
    "description": "Company Name: \nAnti Chaos Solutions Pty Ltd \nJob Title: \nDeveloper Programmer \nEmployment Status: \nFull Time\nLocation:\n Canberra, ACT \nSalary\n : AUD 75,000.00 + Supper per annum\nAbout Us: \nAnti Chaos Solutions is a leading IT solutions provider. We are at the forefront of technology, providing cutting-edge solutions to power businesses globally. We are seeking a talented and motivated Developer Programmer to join our dynamic team in Fyshwick ACT.\n \nPosition Overview: \nAs a Developer Programmer at Anti Chaos Solutions, you will play a crucial role in our Application Services team, focusing on specific technology or projects. You will collaborate with internal stakeholders and engineers, ensuring the smooth operation, development, and management of our cloud-based specific technology or project platforms. This role requires expertise in AWS cloud technologies, CI/CD pipelines, automation, and infrastructure management.\n \nMain Tasks Include: \n \nInvestigating and evaluating the requirements of system programs, including examining issues with connectivity and opportunities for improving data exchanges among platforms such as Affinity Lexus Nexus and Office 365.\nDetecting defects in current systems and assessing the existing API links between Autotask and Datto RMM concerning the Bi Dashboard.\nDeveloping scripts to automate manual tasks.\nMaintaining high standards in coding practices and Documentation.\nTesting, debugging, and correcting bugs using Python in existing projects, to ensure it meets the system's needs and adheres to the standards necessary to satisfy the criteria of wind engineers and other users.\nRecording observations and documenting modifications applied to the system via committing logs in ITG.\nDeveloping, updating, and maintaining detailed technical documentation and operational guidelines to ensure they are clear and user-friendly.\nDocumenting user guides and use-case scenarios to steer the development of data systems and automation tools.\nDeveloping Python scripts to facilitate data entry into legal matters.\nImplementing a BI reporting dashboard and taking responsibility for regular(monthly) maintenance.\nOffering thoughts and visions on the creation of proposals and the architectural design of software.\n \nQualifications:\nBachelor's degree in IT, Computer Science, or related field.\nCertified in AWS Certified Solutions Architect Associate \nCertified in ITIL 4 | IT Service Management.\nProven working experience in installing, configuring and troubleshooting UNIX /Linux-based environments.\nSolid Cloud experience, preferably in AWS\nExperience with virtualization and containerization \nExperience with Database and Network Management\nExperience with monitoring systems (i.e. Service Now, Jira, MoogSoft, DataDog, BigPanda)\nExperience with automation (i.e. CI/CD, Terraform, ControlM, Jenkins, Ansible)\nSolid scripting skills (i.e.shell scripts, Perl, Bash, Python)\n \nAdditional Skills (Preferred):\n \nKnowledge of specific technology or project ecosystem.\nFamiliarity with monitoring tools such as Datadog, and Moogsoft.\nExperience with ServiceNow and Control-M.\n \nHow to Apply: If you are passionate about technology and thrive in a fast-paced environment, we would love to hear from you. Please submit your CV along with a cover letter highlighting your relevant experience and why you are interested in joining our team.\n \nBenefits:\n \nCompetitive salary package\nOpportunities for career growth and development\nExposure to cutting-edge technologies in the IT industry\nCollaborative and inclusive work culture\nProfessional Employees Award 2020\n \n \nJoin us and be part of a team that drives innovation and shapes the future of IT technology! Apply now to embark on an exciting career journey with Anti Chaos Solutions",
    "id": 75848400,
    "listingDate": "2024-05-15T00:10:16Z",
    "location": "Canberra",
    "title": "Developer Programmer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75847225/apply",
    "description": "DHA is looking for a leader to join our talented Software Engineering team and revolutionise DHA’s software landscape. Apply today to become the Assistant Director Software Engineering!\n\n\n \n\n\nTitle: Assistant Director Software Engineering\n\n\nLevel: Executive Level 1\n\n\nLocation: Canberra, ACT\n\n\nSalary range: $113,905 to\n $139,011 per annum plus 15.4% superannuation\n\n\nAbout your team\nThe Business Solutions and Technology (BS&T) group is currently delivering a multi-year Technology Refresh program, revolutionising our systems and capability to elevate DHA service offerings. The Software Engineering team’s role is to contribute to this transformation initiative as part of Multi-Disciplinary Teams (MDT’s) to analyse, build and integrate both new and existing software. In addition, the team supports the software remediation program ensuring existing commitment to technologies are current, bug free and align with security requirements.\n\n\nAbout your contribution\nAs the Assistant Director of Software Engineering, you will have the unique opportunity to shape and implement the software engineering strategies and operations within DHA. Leading a team of talented software engineers, you will pave the way to delivery of high-quality contemporary software solutions that meet both strategic and operational needs of DHA. As a dynamic leader, you will drive innovation and efficiency through the effective management of people, processes, and technology.\n\n\nTo be successful in this role, our ideal leader will:\n\n\n\n\nA bachelor’s degree in Computer Science, Information Technology, Engineering, or a related technical field. Advanced degrees or certifications in software engineering, management or project management are desirable.\n\n\nExtensive experience (typically 5+ years) in software engineering, with at least 2 years in a leadership role managing technical teams.\n\n\nProven track record of leading high-performing teams to deliver complex software projects on time and within budget.\n\n\nStrong technical acumen with hands-on experience in software development and thorough understanding of software engineering principles such as MVC frameworks, Microservices, Integration patterns, and Containerisation.\n\n\nExperience with source control management, CI/CD practices, and preferable familiarity with Azure DevOps.\n\n\nExcellent leadership and communication skills, capable of mentoring and motivating engineering teams.\n\n\nStrong problem-solving skills and the ability to manage complex projects with multiple stakeholders.\n\n\nEffective change management skills, with the ability to smoothly implement technology enhancements and process improvements.\n\n\nPrevious government sector experience would be highly advantageous.\n\n\nExperience in agile methodologies and implementing agile practices in a team environment is desirable.\n\n\n\n\nFor further information regarding this role please refer to the Position Description below or within Defence Housing Australia's \nonline careers site\n.\n\n\nOrder of Merit\nAny merit pools established from this merit-based process will be valid for 18 months from the date of advertising. This merit pool may be used throughout this period to fill similar positions in the event positions become vacant.\n\n\nAny questions? Please contact Aden De Leeuw, Director, Application Development and Integration on T \n02 6268 3719\n E \n[email protected]\n  \n\n\nHow to apply\n\n\nApply now via our \nonline careers site\n with your current resume and a 500-word pitch, as outlined in the position description. We recommend you read the Australian Public Service Commission’s Cracking the Code guidance on how to write your response. Additionally, you should consider the expected behaviours described in the Australian Public Service Commission’s Integrated Leadership System at this role’s level.\n\n\n*A 500-word one page pitch is required to apply for this role.\n\n\nRecruitAbility\nRecruitAbility applies to this vacancy. Under the RecruitAbility scheme you will be invited to participate in further assessment activity for the vacancy if you choose to apply under the scheme; declare you have a disability; and meet the minimum requirements for the job. For more information visit: \nhttps://www.apsc.gov.au/recruitability\n\n\nInclusion and Diversity\nDHA is committed to building an inclusive and diverse workforce. We welcome applications from across our community including, Aboriginal and Torres Strait Islander peoples, women, people with disability, people from culturally and linguistically diverse backgrounds, those who identify as LGBTIQ+, ex-defence members, mature aged employees and carers.\n\n\nApplications close\nApplications close AEST 11:55pm Wednesday 29 May 2024.",
    "id": 75847225,
    "listingDate": "2024-05-14T23:02:04Z",
    "location": "Canberra",
    "title": "Assistant Director, Software Engineering",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75832788/apply",
    "description": "Ready for a career adventure or just curious about your future possibilities? Discover Life at Nova! Connect with us, join our vibrant community, and let's explore how we can elevate your career journey together. It's more than a conversation; it's the start of an exciting new chapter. Let's make it happen!\n \n Your specialized knowledge will be pivotal in strategic planning, protecting our country's interests. Take on the challenge and leverage your Defence skills to make an impact. Employ advanced technology for the analysis of geographic information, aiding mission strategy, and delivering essential insights.\n \n \nSkilled and experienced Defence candidates with demonstrated strengths in the following areas:\nGeospatial Engineer\nSatellite communication Systems Engineer\nRF, HR Engineer\nSystems Engineers\nSoftware Engineer\nElectronic warfare\nCyber security\nSystem Administrator\nProject Managers, Project Support\nCommercial Manager, Commercial Support\nILS,\nScheduler\nAdministration Support\nNova Systems have offices located in - Adelaide, Melbourne, Canberra, Sydney, Newcastle & Brisbane and depending on the opportunity full remote work may be an option.\n \n \nYou will be the first to learn about new and relevant career opportunities at Nova Systems\n \n \nWHY\nFlexible ways of working and dress for your day\nCommitment to Professional and Personal Development\nReward & Recognition Program offering exclusive discounts from hundreds of major retailers, helping you to save on groceries, petrol, holidays and more!\nAdditional Leave entitlements include Reserve Leave, Loyalty Leave, Parental Leave and Purchased Leave\nWellbeing Hub with access to health and fitness content\nEmployee Assistance Program for employees and family members\nAccess to Defence Health and Travel Insurance\nNovated Leasing and Salary Sacrifice\nNova Employee Share Offer\nAn inclusive and supportive culture\nA range of other great benefits, just ask us!\nTO CONNECT and JOIN:\n \n \nPlease click on the 'APPLY NOW' button and complete the application form.\n \n Alternatively for a confidential discussion, please contact \nMel\n in the Nova Talent Acquisition Team on \n(08) 8252 7100\n.\n \n \nNova Systems is committed to building a diverse and inclusive workplace, where \neveryone\n feels safe, valued, and included, where our people are our point of difference.\n \n \nNova Systems does not accept any recruitment agency solicitation.\n \n Nova Systems offers a unique work environment that supports professional and personal growth. With a focus on rewarding hard work and dedication, Nova Systems provides a range of benefits such as loyalty leave, parental leave, and personal wellbeing allowances. They champion a balanced life with flexible core hours and opportunities for remote work. Their commitment to employee development is evident in their engagement with leading universities and support for continuous learning. Joining the Nova community means becoming part of a diverse and inclusive culture that values each individual and their contributions to the company's success",
    "id": 75832788,
    "listingDate": "2024-05-14T07:07:41Z",
    "location": "Canberra",
    "title": "Digital Talent Community",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75826907/apply",
    "description": "About the company:\nSeeing Machines leverages human factors science to develop technology that measures human cognitive state in real-time. We work with the world’s leading vehicle manufacturers to deliver state-of-the-art operator monitoring technology across our chosen transport sectors of commercial road transport (Fleet), automotive, and aviation. In Fleet, our best-in-class aftermarket product Guardian provides drivers and fleet operators real-time protection from distraction and fatigue events. In automotive, we enable safer Advanced Driver Assistance Systems (ADAS) and automated driving solutions and in aviation, our advanced gaze tracking technology understands how pilots interact and monitor instruments – leading to better training and safer operations.\nThe Human Factors group at Seeing Machines collaborates with customers and research partners worldwide, to generate new insights that drive our technology development and validation. Our dynamic team is fast becoming an authority for regulation and policy in this space – leading the industry with best practice Human Factors research & development.\nCombining Human Factors science and applied research, you will directly influence product development with our global customers. You will be part of the Seeing Machines journey as we help shape the future of operator monitoring technology and contribute to reducing driving fatalities and improving aviation safety.\nAbout the opportunity\nThe Research Scientist (Data), Human Factors, will work directly with internal stakeholders and external customers to provide human factors and user-centred input into the design and deployment of Seeing Machines’ technology. This involves leading the design and analysis of human factors experiments that are used to improve the sensing of operator states like fatigue, intoxication, distraction, and high cognitive workload. This includes leading data collection with drivers and pilots in simulators (vehicles and airplanes), on test tracks, and in on-road or operational environments. \nThis role has an emphasis on the analysis of large and complex datasets to generate insights that are communicated to our algorithm and data teams.\nOn a typical day, you might be: \n\n\nWorking with a terabyte-scale dataset to generate new classification features for operator state\n\n\nDesigning an on-road experiment involving data collection with members of the public in our sophisticated test vehicles \n\n\nPresenting data on distracted driving to a major car company to help inform requirements for production driver monitoring systems\n\n\nSupervising a study on fatigued drivers using our in-house simulator \n\n\nCommunicating research outcomes to algorithm and data teams who use this information to enhance our drowsiness detection algorithms\n\n\nDesigning human factors experiments and statistically analysing large and complex datasets involving human operators \n\n\n\n\nGenerating      insights and working with our innovation teams to ensure those insights      directly shape the operator state concepts and features that we develop      and deliver to customers\n\n\nClearly      articulating human factors concepts and research outcomes to internal and      external teams to support product deployment \n\n\nContributing      to the preparation of technical reports and peer-reviewed publications      related to the analyses of Seeing Machines’ Human Factors datasets\n\n\nPresenting      research outcomes and position papers to internal and external customers,      industry groups and conferences\n\n\nHelping      to promote Seeing Machines’ technology, credibility, and scientific      leadership through the conduct and dissemination of high-quality research      outcomes\n\n\nAbout you\nWe value the breadth and depth of experience that our people bring to their work. We are seeking people with a good mix of technical competency and personal capability. Specifically, we are looking for people with:\n\n\nA Masters or PhD (awarded or currently completing) in human factors, psychology, ergonomics, data analytics or a related field \n\n\nStrong skills and demonstrated experience with large datasets, advanced data analysis and formal statistical techniques\n\n\nDemonstrated experience in the use of accepted methods in human factors or experimental psychology \n\n\nExperience designing, conducting, and analysing quantitative research with human participants\n\n\nExperience with Python or other scripting language\n\n\nEvidence of producing high-quality research outcomes and in disseminating effectively to academic and/or industry settings\n\n\nEvidence of ability to generate insights that have shaped positive outcomes in research, industry, and/or policy settings\n\n\nDesirable\n\n\nExperience collecting and analysing data using a simulator and/or test vehicles\n\n\nExperience in conducting successful research projects (with internal and external providers)\n\n\nUnderstanding of the principles of research ethics \n\n\nExperience communicating complex research concepts and outcomes to internal stakeholders (e.g., Product Managers, Software & Hardware Engineers) to provide input into system design and deliver successful customer projects\n\n\nKnowledge of operator states and associated theoretical and measurement approaches\n\n\nExperience with machine learning techniques\n\n\nWhy Seeing Machines\nWe are inventive, innovative and collaborative and are making a real difference to safety on roads, all around the world\nWork flexibly – we encourage our people to manage their work and personal lives to achieve a balanced outcome\nWe are global, Seeing Machines serves a growing market in the UK, Europe, Africa, North America, Latin America, and Asia Pacific\nWe are focused on employee support and understand the importance of our collective wellbeing. You will have access to our Employee Assistance Program any time you require it\nWe reward and recognise achievement. You will have access to our global benefits and reward platform.\nHow to apply\nTo apply, please include an updated resume and a cover letter outlining your interest in the role and how you could make a difference at Seeing Machines.",
    "id": 75826907,
    "listingDate": "2024-05-14T04:21:34Z",
    "location": "Canberra",
    "title": "Research Scientist (Data), Human Factors",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75754803/apply",
    "description": "Classification: \nANU Officer 8 (Specialist)\nSalary package: \n$109,945 – $117,567 per annum plus 17% superannuation\nTerm:\n Full-time, Fixed term (up to 2 years)\nPosition Description and Selection Criteria: \nPD&PEWER_Senior Research Software Engineer, Python Specialist.pdf\n\n\n\n\nFlexible working arrangements to encourage a healthy work/life balance, including consideration of part-time roles and remote work. \n\n\nExceptional workplace culture with a supportive, diverse and inclusive team. \n\n\nGreat work location with world-class staff amenities including gyms, swimming pool, childcare centres, etc. \n\n\nExcellent remuneration and conditions, including 17% superannuation contributions, annual leave loading and a range of benefits  \n\n\n\n\nAbout Us\n \n \nACCESS – The Australian Community Climate and Earth System Simulator – is a collaborative venture between Government and the Australian research community to support development, maintenance and access to climate and weather models and data.   \n\n\nHosted at ANU, ACCESS-NRI (ACCESS National Research Infrastructure) is established as a multi-party collaborative venture responding to the current and future needs of Australia’s scientific, Government and stakeholder community.  \n\n\nAt the heart of ACCESS is a community of Research Software Engineers with a range of skills including high-performance computing, climate and earth system model development, advanced visualisation, model optimisation, code repository management, machine learning, model evaluation and data science. \n\n\nACCESS-NRI provides a supportive and enriching workplace for its staff through its strong commitment to equity, diversity, inclusion, and wellbeing initiatives. Aboriginal and Torres Strait Islander peoples, Women and other people that will increase the diversity of the ACCESS community are strongly encouraged to apply. \n\n\nThe Role \nAre you a talented Python developer looking for an exciting opportunity? The Model Evaluation and Diagnostic team focuses on developing and enhancing workflows to facilitate the analysis of ACCESS model outputs. Additionally, we compare model outcomes with those of other international models. Our work is crucial in supporting Australia's submissions to the Coupled Model Intercomparison Project (CMIP), providing scientific inputs for international climate change panels.  \n\n\nResponsibilities include: \n\n\n\n\nCollaborate with cross-functional teams to understand requirements and translate them into technical specifications.  \n\n\nDesign and develop scalable, efficient, and maintainable Python code for data analysis and processing.  \n\n\nImplement algorithms for statistical analysis, machine learning, and predictive modelling.  \n\n\nCreate data visualisation tools and techniques to present complex information in a clear and intuitive manner.  \n\n\nOptimise code performance and reliability through testing, debugging, and refactoring.  \n\n\nStay up to date with the latest developments in Python, data science, and related technologies. \n\n\n\n\nThis is an exciting opportunity to work at the intersection of earth system models, climate change and high-performance computing to help address major challenges facing society. \n\n\nThe role of Research Software Engineer will have demonstrated experience in working as part of a software development team, attention to detail, flexibility, and ability to prioritise tasks to accomplish both short and long-term goals. The ability to self-direct and learn new skills as needed, matters more than any specific software package, as does an interest and demonstrated aptitude for picking up new things and running with them.  \n\n\nIt is essential that you can work with others, contribute to varied projects as needed, and be able to balance ongoing maintenance and support with scoping and delivery of new projects and other longer-term deliverables. The role has a mixture of internal and external stakeholder engagement, with varied technical and non-technical backgrounds.  \n\n\nIf this sounds like you, and you are excited to support innovative research and play an active role in making a difference in the world, then please get in touch to find out more about the position.    \n\n\nSkills and Requirements\n \n \nRequired:   \n\n\n\n\nProven experience (+3 years) as a Python Developer, with a focus on data analysis and scientific computing. \n\n\nStrong proficiency in Python and libraries such as NumPy, Pandas, SciPy, and Matplotlib. \n\n\nSolid understanding of data structures, algorithms, and software design principles. \n\n\nExcellent problem-solving skills and attention to detail. \n\n\nAbility to work independently and collaboratively in a fast-paced environment. \n\n\nEffective communication skills and the ability to explain technical concepts to non-technical stakeholders. \n\n\nCommitment to a safe, inclusive and respectful workplace environment.\n\n\nPassionate about working in an organisation that values and promotes diversity, equity, inclusion and wellbeing. \n\n\n\n\nDesirable:  \n\n\n\n\nMaster's or PhD in Computer Science, Mathematics, Statistics, Physics, Earth Sciences or related field. \n\n\nLinux/Unix experience.\n\n\nExperience with low-level scientific programming languages (e.g., Fortran, C) \n\n\nFamiliar with high-performance and/or cloud computing platforms. \n\n\nFamiliarity with version control systems such as Git. \n\n\nExperience with machine learning frameworks such as TensorFlow, PyTorch, or scikit-learn. \n\n\nExperience working with geospatial data formats, standards and tools. (e.g., GIS, Python)  \n\n\n\n\nFor further information, please contact Romain Beucher (Model Evaluation and Diagnostics, Team Lead), E:\n \n[email protected]\n\n\nThe University actively encourages applications from Aboriginal and Torres Strait Islander people. For more information on employment opportunities at the ANU, visit \nhttps://services.anu.edu.au/human-resources/respect-inclusion/aboriginal-torres-strait-islander-employment.\n \n\n\nANU values diversity and inclusion and believes employment opportunities must not be limited by socio-economic background, race, religion or gender. For more information about staff equity at ANU, visit \nhttps://services.anu.edu.au/human-resources/respect-inclusion\n.  \n\n\nApplication Information\n \nTo apply for this role please upload the following documents: \n\n\n\n\nA statement addressing the selection criteria. \n\n\nA current curriculum vitae (CV) which includes the names and contact details of at least two referees (preferably including a current or previous supervisor). If your CV does not include referees, you can complete these online when prompted in the application form. \n\n\nOther documents, if required. \n\n\n\n\nApplications that do not address the selection criteria may not be considered for the position. \n\n\nPlease note:\n \nThe successful applicant must have rights to live and work in Australia. The successful candidate will be required to undergo a background check during the recruitment process. An offer of employment is conditional on satisfactory results. \n\n\nClosing Date: 9 June 2024",
    "id": 75754803,
    "listingDate": "2024-05-10T06:10:27Z",
    "location": "Canberra",
    "title": "Senior Research Software Engineer, Python Specialist",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75727228/apply",
    "description": "The Australian Bureau of Statistics is looking to fill the roles of\n Platform Engineer\n and \nSenior Platform Engineer\n to join our Data, Middleware and Analytics team in the Security and Infrastructure Branch. \nThese are ongoing, permanent roles and the successful applicants can be located at either of our offices in Adelaide, Belconnen (Canberra) or Docklands (Melbourne), although a hybrid model of working from home and office applies.\nAbout the business area\nOur branch builds, delivers and maintains ICT infrastructure and platforms in support of ABS’ mission of collecting, collating, and disseminating official statistics to support decision making across Australia’s public and private sectors.\nThe Data, Middleware and Analytics (DMA) team are responsible for the design, implementation, administration and maintenance of ABS’ web, middleware, application and data hosting technology\nstack. This stack includes:\napplication load balancing and firewalling\nweb application platforms\ndata management and analytics platforms\ndatabase management services/systems.\nThe team helps build integrated, secure and robust solutions while working with key stakeholders, including ABS technical and business teams, application development teams and strategic vendors.\nAbout the roles\nAs a Platform Engineer or Senior Platform Engineer your responsibilities may include the following:\nrespond to service requests and prioritise work\nprovide technical advice and support on best practice for design, installation, deployment, configuration and, if applicable, hardening activities\ntroubleshoot incidents, identify root cause, resolve and document problems and implement preventative measures\nwork with team members, colleagues and key stakeholders to plan and deliver platform changes\ncreate and maintain good and current analytical tool knowledge in accordance with team policy\nestablish and maintain a good working relationship with vendors and the wider user base\nescalate and manage resolution of major issues with vendor support channels\nimplement the release of patches and updates in a timely fashion\ncreate and maintain technical and procedural documentation\nsolution design\nliaise with clients and vendors to troubleshoot and resolve critical issues.\nAdditionally, as a Senior Platform Engineer, your responsibilities may also include:\nmanage service requests and plan priorities\nengage with business and technical stakeholders to provide technical advice and make recommendations based on requirements\ndevelop and maintain secure solutions in accordance with established good practices and patterns, including an awareness of cyber security threats and performing mitigative activities in a timely manner\ncreate and maintain good and current knowledge of middleware platforms and their management in accordance with team policy\nmanage the release of patches and updates in a timely fashion\nstaff management and mentoring.\nWhat we are looking for (selection criteria)\nTo be suitable you should have most or all of the following skills, qualities and experience: \nexperience with the administration of application platforms and systems on a Windows or Linux Server environment, including but not limited to: \no  ability to design, test, deploy, integrate, operate and administer a range of off-the-shelf, custom and IaaS/PaaS/SaaS ICT systems\no  undertake performance troubleshooting, platform testing and tuning\no  develop policies and procedures\ntechnical capabilities in at least one or more of the following technology areas:\no  Web, Middleware and Application Hosting Platforms\n* web application platforms (JBoss, IIS, Tomcat) \n* application load balancing and firewalling (F5, AWS WAF) \no  Public Cloud Platform and Services Administration: \n* Amazon Web Services (Firewall Manager, EC2, CloudFormation, Elastic Container Service)\ngood communication, negotiation and influencing skills, including providing technical advice and support relating to best practice for design, installation, deployment and configuration\nability to establish, participate and maintain relationships with stakeholders, including escalating and managing resolution of major issues\ngood technical and analytical / troubleshooting skills with the ability to work in an environment of ambiguity and constant technical change. \nThe following will also be highly regarded for the Platform Engineer role: \nan understanding of Infrastructure-As-Code, containerisation concepts and modern CI/CD solutions and tooling. \nThe following will also be highly regarded for the Senior Platform Engineer role: \nexperience with/knowledge of containerisation tools and technologies (Docker, Kubernetes, AWS ECS/ECR/EKS).\nThe following will also be highly regarded for both roles:\nknowledge of security standards, mitigation strategies and Whole-of-Government compliance requirement\ncapacity to participate in a roster to provide technical support for critical incidents outside of core business hours (on-call allowance provided).\nHow to apply\nTo apply, you will need to upload your current resume, provide referee details and respond to the following: \nProvide one or two examples of projects you have delivered, or major pieces of work that you have been involved in.\nRefer to the selection criteria and attempt to incorporate all criteria in your response. Please limit your response to 500 words.\nApplications close at 11:30 p.m. (AEST), Wednesday 22nd May 2024.",
    "id": 75727228,
    "listingDate": "2024-05-09T06:06:37Z",
    "location": "Canberra",
    "title": "Platform Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75718619/apply",
    "description": "The Role\nSATCOM Ops employs highly motivated, suitably qualified and experienced persons to perform the duties of the Satellite Systems Engineers (SSE). Duties of the SSE includes providing specialist technical support for the operation and management of strategic satellite communication systems including, anchor stations, network systems, satellite systems and satellite communication planning.\nThe Satellite Systems Engineer (SSE) is expected to operate with limited or broad supervision to ensure essential satellite communication services are provided to Defence, other government agencies, and allies. Each SSE is given responsibility for a share of satellite systems both existing and under development, and is expected to engineer or otherwise provide SME advice on the SATCOM resources required to support Defence’s requirements. The SSE is expected to provide extensive support to major capability acquisition and delivery projects.\nThe additional payment is a Building Defence Capability Payment (BDCP) which enables Defence to provide a premium, in addition to the rate of salary otherwise payable under the Enterprise Agreement (EA) to some or all of the jobs within a critical occupation(s) or discipline within a workplace. \nApplicants engaged into a BDCP position must consider the following. BDCPs provide remuneration in addition to the Defence Enterprise Agreement (EA). This arrangement is subject to meeting eligibility criteria and is subject to annual review. Should your performance fall beyond requirements or the eligibility criteria not be met, your eligibility for the BDCP may be reviewed and ceased. \nIt may also be ceased should you change positions or the requirement for the BDCP is no longer necessary, as determined by Defence. Should the BDCP be ceased you will be advised and your BDCP additional payment will cease.\nAbout our Team\nADF Satellite Communications Operations (SATCOM Ops) is responsible for the planning, operation, and defence of all SATCOM missions in support of ADF operations, Raise Train Sustain functions, coalition forces, and whole of government customers. SATCOM Ops engages in mission planning, payload and transmission control operations for sovereign, international and commercially-leased satellite systems.\nAs a member of the SATCOM Ops team, you will play a key supporting role in the provision and management of satellite communication services for Australian military and government elements around the world. SATCOM Ops is a multi-skilled workforce, and the advertised position provides an opportunity to contribute to the delivery of a strategic Defence function, while broadening your skillset in ICT service delivery.\nOur Ideal Candidate\nSATCOM Ops is seeking highly-motivated and skilled Senior Engineers with experience in satellite systems including ground, terminal, spacecraft and control segment engineering and planning.\nKey skills and experience include:\nProvide ITIL Tier 3 style support to operational SATCOM systems.\nProvide specialist technical support to SATCOM projects including assistance to systems engineering, integrated logistics, training development and transition into operational processes\nManage and advise on satellite payload operations; ground segment configuration; network support; transponder planning; contract and procurement management; policy and procedural development\nAble to provide on-going tutelage to SATCOM planners and operators, including APS6 Satellite Systems Specialists\nProvide integral support and advice to major and minor SATCOM capability acquisition projects\nProvide specialist advice on SATCOM-related policy-making, procedure and protocol development\nApplication Closing Date: Thursday 23 May 2024\nFor further information please review the job information pack, reference \nJCG/02823/24\n on \nhttps://defencecareers.nga.net.au/?jati=2D8CCDDB-586E-6D1A-A946-DABC09EEDEDA",
    "id": 75718619,
    "listingDate": "2024-05-09T01:40:22Z",
    "location": "Canberra",
    "title": "Satellite Systems Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75693353/apply",
    "description": "At Shine, we develop pragmatic, innovative technology solutions using leading edge technologies and expertise.\n\n\n\n\nBut really, everything we build is about people.\n\n\n\n\nFounded in 1998, Shine, is a leading IT consultancy and software development services provider.\n\n\n\n\nWe are privately owned with a team of 150+ consultants and engineers, we’re based in Sydney, Melbourne and Canberra.\n\n\n\n\nWhen you work at Shine, you will work with a team that:\n\n\n\n\nLoves sharing experiences and learning from each other \n\n\nIs deeply passionate about all things technology\n\n\nSupports flexible working arrangements \n\n\nEncourages further learning opportunities \n\n\nChallenges you – and encourages you to excel\n\n\n\n\n\n\n\n\n\n\nAs a DevOps Engineer at Shine Solutions, an AWS Advanced Services Partner, you will have a strong background with cloud technologies and DevOps practices. Your role will be key in developing, deploying, and optimising solutions tailored to the unique requirements of our clients.\n\n\n\n\n\n\n\n\nYou will be involved in (though not limited to):\n\n\n\n\nDesigning and building out of robust infrastructure and software delivery pipelines\n\n\nImplement and manage AWS Cloud Infrastructure\n\n\nProvide input into automated provisioning, Continuous Integration (CI), and Continuous Development (CD) solutions\n\n\nDevelop and maintain CI/CD pipelines, automating build, test, and deployment processes\n\n\nUse tools such as CloudFormation, Terraform, and CDK for infrastructure orchestration\n\n\nDevelop and execute test plans, identifying and logging issues\n\n\nCreate change management procedures and implementation plans, considering the impact on existing systems\n\n\nProvide support during implementation phases\n\n\nWork closely with development teams to integrate DevOps and DevSecOps best practices\n\n\n\n\n\n\n\n\n\n\nYou will bring skills and experience such as:\n\n\n\n\nDeep understanding and experience in DevOps roles with a focus on AWS environments\n\n\nProficiency in core AWS services (EC2, S3, RDS, Lambda, DynamoDB, etc.)\n\n\nExperience with CI/CD tools (Jenkins, GitLab CI/CD, Bamboo, or similar)\n\n\nStrong Infrastructure as Code (IaC) experience with tools like AWS CloudFormation, Terraform, or AWS CDK\n\n\nStrong scripting skills in languages such as Python, Bash, or PowerShell\n\n\nWorking knowledge of DevOps and Agile methodologies\n\n\nUnderstanding of AWS network configuration and security best practices (VPC, Security Groups, IAM roles/policies)\n\n\nPrior knowledge of AWS Landing Zone \n\n\nExperience with logging and monitoring tools such as ELK, Prometheus, Grafana and Security tooling such as Snyk, SonaQube, Open Policy Agent etc.\n\n\n\n\n\n\n\n\n\n\n\n\nP.S:- \nThe successful applicant must be an Australian Citizen.\n\n\n\n\n\n\n\n\n\n\n\n\nWe put people first. And it pays off. \n\n\n\n\n\n\n\n\nAt Shine, Integrity is more than just a platitude. It’s ingrained in all that we do - from our carbon neutral footprint, to our philanthropic activities to conducting regular reviews of our actions to ensure that we foster a diverse and inclusive workplace.\n\n\n\n\n\n\n\n\nWe value diversity, equity, and inclusion at Shine. We believe that creating a diverse team, which includes individuals from different backgrounds and with varying experiences, skills, and perspectives, will drive innovation, creativity, and success.\n\n\n\n\n\n\n\n\nWe’ve created a working environment that respects and nurtures technologists. Our staff engagement rates are significantly higher than industry averages. Our average tenure is also longer. And our staff turnover is lower.\n\n\nIn fact, our engagement rate of 85% places Shine in the top 10% of Professional Services Organisations globally. \n\n\n\n\n\n\n\n\nHow do we do it? By putting you first – always. \n\n\n\n\n\n\n\n\nWhat else can you expect? \n\n\nOn top of our one-of-a-kind culture, you’ll also enjoy some tangible perks like: \n\n\n\n\n5 days of learning leave along with funding for approved training programs and certifications, such as AWS and GCP\n\n\nKnowledge Sharing Bonuses ($250 - $1600) to share your expertise on our blog, at team forums and industry events\n\n\nBiennial Tech Allowance (in addition to your work issued tech)\n\n\n$5000 Referral Bonus (on a successful hire referred by a Shiner)\n\n\nAccess to online training modules to keep abreast of the latest technologies\n\n\nLifestyle leave - you can buy extra annual leave each year, out of pre-tax income\n\n\nAccess to an EAP (Employee Assistance Program) for confidential counselling sessions \n\n\nWe are a certified Circle Back Initiative Employer and commit to respond to every applicant.\n\n\n\n\n\n\n\n\n\n\nIf you’re looking to work for leaders in technology solutions who put People First, you’ve found a match!",
    "id": 75693353,
    "listingDate": "2024-05-08T04:50:23Z",
    "location": "Canberra",
    "title": "DevOps Engineer (AWS Migration)",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75658840/apply",
    "description": "Join Our Exceptional Team\n At Control & Electric Pty Ltd in Canberra, ACT.\nWe are seeking a BMS technician to join our dynamic workforce. If you're passionate about HVAC/BMS controls and thrive in a high-performing team, this opportunity is perfect for you!\n \nDuties & Responsibilities\nCurrently looking to employ both Service Technicians and Engineering/Commissioning Technicians\nConduct service maintenance works and providing customers reports and solutions.\nConduct BMS Site Commissioning (Including Low Voltage & Extra Low Voltage Electrical Commissioning)\nRoutine Tasks associated with Current & Future BMS projects.\nParticipate in all required Company training.\nComply with all Control & Electric WHS Policies / Procedures.\nAble to work unsupervised and as a team member.\n \nSkills & Experience\nPrevious BMS/DDC software engineering skills is preferred, but not essential.\nStrong knowledge of building mechanical services.\nCompetent PC skills are essential.\nSound knowledge of Controls Fundamentals and HVAC Protocols.\nUnderstanding of IP related protocols, networking and communications.\nAn electrical license or restricted electrical license is preferred, but not essential.\nPrevious Siemens Apogee BMS software engineering experience preferred, but not essential.\n \nBenefits\nCompany vehicle\nLaptop\nMobile phone\nCompany Uniforms\nsystems training will be provided.\nAttractive wage negotiable based on experience and skill level including:\nAbove Award Hourly Rate\nProductivity allowance\nTravel allowances\nRedundancy benefits\nPaid Parking\nAn excellent team environment that promotes collaboration and support.\nOpportunities to progress within the company with additional benefits.\n \nContinuous Learning and Safety\nWe believe in the power of ongoing learning and development. That's why we provide comprehensive training to ensure you excel in your role. Safety is our top priority, and you'll be expected to comply with all Control & Electric WHS Policies and Procedures.\n \nAbout Control & Electric Pty Ltd\n \nControl & Electric Pty Ltd is a wholly Australian owned company based in Canberra and was first established in 1980. The past 40+ years has seen the company grow from an initial staff level of two employees to today's workforce, which is in excess of 50 across two branches in Canberra and Newcastle. The original philosophy of the company however still remains unchanged. That is, maintaining a close relationship with our clients to produce quality turnkey installations with minimum or zero defects. This was initiated in our early years and has been such an important ingredient in our growth.\nContact\nIf you're ready to join a company that values expertise, fosters teamwork, and prioritises client satisfaction, we'd love to hear from you. Apply today and become a valuable member of our team at Control & Electric Pty Ltd! Visit our website at controlandelectric.com.au for more information about our company.\nSubmit your resume by the site or to discuss this role please contact Matt Smith on \n02 6299 6233",
    "id": 75658840,
    "listingDate": "2024-05-07T05:29:58Z",
    "location": "Canberra",
    "title": "BMS Technician",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75649490/apply",
    "description": "Company Description\n\n\nAbout us:\nWe are NCS Australia! We have brought together Australia’s best tech talent, working as one to harness technology and advance our communities, to make the extraordinary happen.\n \nWe're proud of our rich history of partnering with our clients to develop end to end digital technology solutions to accelerate their transformation and innovation journey. For over 40+ years our diverse global teams have delivered large-scale, mission-critical, multi-platform projects to governments and enterprises. \n\n\nJob Description\n\n\nAbout the role: \nAs a Senior Technical Consultant/ Developer you’ll have deep expertise in the Dynamics CRM platform. You’ll partner with our clients to design, develop, optimize and maintain scalable and reusable solutions to accelerate their digital transformation journey’s.\n \nMost of all, you'll have strong consulting skills, curiosity and a desire to add value. As an NCS consultant, we'll want you to make a positive impact and work with our clients to upskill their teams, improve delivery and achieve outstanding outcomes\n \nOn offer is an exciting career where you'll make an impact and work with innovative technology solutions. You'll perfect your skills alongside a talented and collaborative team while enjoying the recognition, progression and extensive benefits of a global organisation.\n\n\nQualifications\n\n\nPrevious experience in a similar role as an architect or senior developer for large complex solutions using the Microsoft Stack\nAn expert in Dynamics 365 CRM, Power Platform (PowerApps Portal, Canvas and Model Driven Apps, Power Automate)\nExperience in implementing Field Services and / or Project Services Automation. In-\nExperience in Configuration and Customisation of Dynamics 365 CRM\nDevOps with Dynamics 365 CRM for requirements management and ALM (CI/CD)\nExperience in a Software as a Service (SaaS) environment, SQL Server, HTML, C#, .NET\nSolid understanding of Relational Database concepts\nExperience working in agile environments\n\n\nAdditional Information\n\n\nWhy join us:\nAt NCS Australia, you'll be part of a team that values your growth and development. Our comprehensive global learning and development program will equip you with the skills and knowledge needed to succeed. Plus, you'll be mentored by some of the industry's best, and have access to a worldwide network of career opportunities. Join us now and discover just how far your career can go!.\nWe are in the process of refreshing our employee benefits, so don’t forget to ask our Talent Acquisition Team about what’s on offer. \nWe take pride in our commitment to valuing and supporting our people and the communities we serve. Diversity, inclusivity, and being different are not just buzzwords for us - they are integral to our culture. We are dedicated to upholding Equal Employment Opportunity Principles and providing reasonable accommodations to all our applicants. If you require any assistance or modifications to navigate our careers site or complete your application, please don't hesitate to reach out to us at \n[email protected]\n.\nOther important stuff: \nTo be eligible for a position with us, applicants will need to have valid work rights for Australia and be willing to undergo a comprehensive background checking process, including probity and police checks.\nAs we navigate through our business integration process, we will continue to issue contracts under our existing entities of ARQ, Dialog, CatapultBI, ICEMEDIA, Eighty20, Riley or Access HQ.\nAgencies:\nWe’ve got this. We request that you do not contact NCS employees outside of the Talent Acquisition team. NCS exclusively accepts resumes from agencies on our preferred supplier panel through the NCS Agency Portal. Agencies that submit resumes must have a valid fee agreement and be assigned to the particular requisition by the Talent Acquisition team. Any resumes that are submitted outside of this process will become the sole property of NCS. If a candidate is hired outside of this process, no fee or payment will be given.",
    "id": 75649490,
    "listingDate": "2024-05-07T01:05:46Z",
    "location": "Canberra",
    "title": "D365 CRM Developer ",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75581530/apply",
    "description": "Civil Engineer - Exciting Opportunity in Canberra's Leading Developer & Construction Group\n \nAre you an experienced civil engineer seeking a challenging role with a reputable development construction group? Join our team in Canberra and become an integral part of our innovative projects, including the groundbreaking Yowani Grounds Development and The Garema Place Hotel.\n \nAbout the Projects:\nYowani Grounds：\nLed by local Canberra developer TP Dynamics, renowned for its focus on large community projects, Yowani Grounds is poised to become Canberra's largest mixed-use development. Positioned strategically at the intersection of Canberra's main entry axis, this project will create a vibrant mini-city comprising over 1000 residences, complemented by retail establishments, cafes, and inviting public areas.\nThe Garema Place Hotel：\nThe Garema Place Hotel will be a 10-storey mixed-use hotel building on a 1500sqm site. It will contain 3 basement car park levels and amenities comprising around 238 hotel rooms, multiple restaurants and bars, a wellness center, function rooms, and ballrooms. The development will also feature a center skylight atrium with an acrylic-bottomed pool and multiple outdoor garden terraces on the top levels.\nResponsibilities:\nProject Leadership: Lead civil engineering efforts throughout all phases of the development, ensuring adherence to project objectives, timelines, and quality standards.\nDesign Integration: Collaborate closely with architects, urban planners, and other stakeholders to integrate civil engineering solutions seamlessly into the overall project design, optimizing functionality, sustainability, and aesthetic appeal.\nInfrastructure Planning: Oversee the planning and design of essential infrastructure components, including roads, utilities, stormwater management systems, and landscaping elements, to support the needs of the mixed-use precinct.\nConstruction Management: Provide technical oversight during the construction phase, liaising with contractors, subcontractors, and regulatory agencies to ensure compliance with specifications, codes, and regulations.\nRisk Management: Identify and assess potential risks and challenges associated with civil engineering aspects of the project, developing proactive strategies to mitigate risks and maintain project continuity.\nStakeholder Engagement: Engage with project stakeholders, including clients, government agencies, and community representatives, to communicate project requirements, address concerns, and foster positive relationships.\n \nQualifications:\nBachelor's degree in Civil Engineering or related field; \nMinimum of 5 years of experience in civil engineering, with a focus on large-scale development projects.\nProficiency in relevant civil engineering software and tools, such as AutoCAD, Civil 3D, and hydraulic modeling software.\nStrong communication, leadership, and problem-solving skills, with a demonstrated ability to collaborate effectively in multidisciplinary teams.\n \nBe part of a dynamic and forward-thinking team dedicated to shaping the future of urban development in Canberra. \n \n \nApply now to join us as a Civil Engineer and embark on a rewarding career journey with TP Dynamics.",
    "id": 75581530,
    "listingDate": "2024-05-03T05:38:34Z",
    "location": "Canberra",
    "title": "Civil Engineer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75582189/apply",
    "description": "About Karbon\n\n\nKarbon is the global leader in practice management software for growth-minded accounting firms. We provide an award-winning, highly collaborative cloud platform that streamlines work and communication, enabling the average accounting firm using Karbon to save 16 hours per week, per employee.\n\n\nWe have customers in 34 countries and have grown into a globally distributed team, with our people based throughout the US, Australia, New Zealand, Canada and the United Kingdom. We are well-funded, ranked #1 on G2, have a fantastic team culture, are growing rapidly, and making a global impact.\n\n\n\n\nAbout Karbon\n\n\nKarbon is the global leader in practice management software for growth-minded accounting firms. Our award-winning, collaborative cloud platform streamlines work and communication, enabling significant time savings and efficiency gains. With customers in 34 countries and a globally distributed team, Karbon is growing rapidly and making a global impact.\n\n\nPosition Overview\n\n\nSeeking software engineers skilled in balancing efficiency and excellence. Ideal candidates thrive in teamwork, innovate, and maintain products while valuing autonomy and creativity. We prioritize ownership and impact, welcoming diversity, passion, and authenticity in a collaborative, sincere environment.\n\n\nKey Responsibilities\n\n\n\n\n\n\nBalance Speed and Quality\n—You adeptly balance the need for speed with a commitment to quality. You know when to accelerate to meet deadlines and when to focus on detail for perfect outcomes. You have the judgment to navigate these priorities effectively, maintaining a keen eye for both efficiency and excellence.\n\n\n\n\nWork effectively as part of a team\n—Software development is a team sport, where solo victories are rare. It thrives on your robust collaboration and dedication to supporting your colleagues. You contribute to a harmonious blend of focused work and engaging discussions, flexible between home and office settings, ensuring everyone can contribute to the team's success. You are eager to be part of an exceptional team, ready to invest your efforts towards collective achievements.\n\n\n\n\nBuild and maintain\n—Your role involves developing innovative products and ensuring the continuous operation of existing ones. You appreciate not only the allure of new technologies but also the importance of iterative improvements on established systems. Your commitment to pioneering and preservation is crucial.\n\n\n\n\nAutonomy\n—You are inherently curious, finding joy in learning and exploration. Faced with challenges and direction rather than predefined solutions, you engage fully and creatively with problems.\n\n\n\n\nOwn your work\n—You take genuine pride in your creations, feeling a deep sense of responsibility for the products you develop and their impact on customers. This sense of ownership is paramount, and you share this commitment.\n\n\n\n\nBring your passion and personalit\ny—Your creativity, curiosity, and authentic self make the team stronger. If you've worked in highly political environments, you'll find our culture, free from office politics and valuing openness and authenticity, a refreshing change.\n\n\n\n\nQualifications\n\n\n\n\nWe are primarily a .NET-focused team, seeking candidates proficient in C#, SQL Server, and .NET technologies (MVC, Web API, .NET Core). That said, candidates with demonstrated ability to repeatedly and successfully adapt to new technologies over several years will also be considered.\n\n\nTeam versatility is important, so experience with JavaScript/TypeScript is considered a plus. \n\n\nStrong communication skills are essential for our international, multi-locational team dynamics.\n\n\nCandidates should understand scalable systems, software architecture, data structures, and algorithms. \n\n\nFamiliarity with the full software development life cycle and engineering best practices is required.\n\n\nA Bachelor’s degree in Computer Science or equivalent experience is needed.\n\n\n\n\n\n\nKarbon embraces diversity and inclusion, aligning with our values as a business. Research has shown that women and underrepresented groups are less likely to apply to jobs unless they meet every single criteria. If you've made it this far in the job description but your past experience doesn't perfectly align, we do encourage you to still apply. You could still be the right person for the role!\n\n\nWhen we look for talent to join our team, we want unique, creative, and amazing people that align with values, and help us build a world-class product and company.\n\n\nDiversity and inclusion are fundamental to who we are, and what has always made us tick.\n\n\nWe recruit and reward people based on capability and performance. We don’t discriminate based on race, gender, sexual orientation, gender identity or expression, lifestyle, age, educational background, national origin, religion, physical or cognitive ability, and other diversity dimensions, that may hinder inclusion in the organization.\n\n\nGenerally, if you are a good person, we want to talk to you. 😛\n\n\nIf there are any adjustments or accommodations that we can make to assist you during the recruitment process, and your journey at Karbon, contact us at \n[email protected]\n for a confidential discussion.\n\n\nAt this time, we request that agency referrals are not submitted for this position. We appreciate your understanding and encourage direct applications from interested candidates. Thank you!",
    "id": 75582189,
    "listingDate": "2024-05-03T03:20:00Z",
    "location": "Canberra",
    "title": ".NET Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75574172/apply",
    "description": "TAFE NSW Life-Changing Careers\n\n\nSenior Client Applications Engineer\n\n\nTAFE Worker Level 9\n\n\nLocation: Negotiable within a TAFE NSW Campus\n\n\nFull-time Permanent Position\n\n\nBase salary range of $119,757 - $132,188 p.a plus employer’s contribution to superannuation and annual leave loading\n\n\nAt TAFE NSW, we are dedicated to life-changing impact.\n\n\nWe invest in our people\n\n\nWe provide you with tools and ongoing training and professional development, health and wellbeing programs, and a 35-hour working week with a variety of flexible working options.\n\n\nAbout the role\n\n\nThe Senior Client Applications Engineer is responsible for supporting and implementing the tools and processes to package, deploy and secure end user applications across a large and geographically dispersed organisation. The position works closely with internal and external stakeholders to support end to end application lifecycle services that comply with TAFE NSW’s cyber security strategic approach and policies. The position works broadly and collaboratively with security engineers and other specialists and has an afterhours on-call requirement to meet business needs.\n\n\nWe have 1 x permanent position with hybrid and flexible work arrangements and negotiable location within NSW (Subject to campus availability).\n\n\nAbout You\n\n\nAs a Senior Client Applications Engineer, you will have advanced scripting, automation and software deployment experience using Intune, Configuration Manager (SCCM) and Jamf Pro. You have worked in large and complex IT infrastructure and have experience successfully deploying various technologies across the business.\n\n\nYou will have considerable experience in end user application packaging and deployment with specialist technical capabilities relevant to a large, complex organisation. You will also have demonstrated experience applying information security and/or cyber security principles and concepts and ability to work on-call afterhours to meet operational requirements.\n\n\nYou enjoy working with others and ensure adequate support is provided throughout the project lifecycle. You place the customer at the centre of the decision making process and ensure industry trends, software developments and innovative technologies are considered.\n\n\nYou have attention to detail, excellent communication skills and are analytical. You take initiative in problem resolutions and enjoy collaborating with your team to ensure seamless delivery of service.\n\n\nHighly Regarded\n\n\n\n\nAbility to maintain a secure and consistent end user environment through the use of relevant tools, group policies, and scripting languages for Windows and Mac operating systems.\n\n\nExperience automating the delivery of and securing end user applications using Intune, Config Manager, Jamf Pro and Microsoft Defender for Endpoint.\n\n\nExperience designing and implementing security controls to meet standards set forth in cybersecurity frameworks, such as the Australian Signals Directorate Essential Eight.\n\n\n\n\nDon’t miss this opportunity to join a supportive, specialist team where your growth and personal development is valued.\n\n\nTo find out more about the role, click to view the \nPosition Description\n.\n\n\nOur commitment to Diversity, Equality, and Inclusion\n\n\nWe are committed to creating a culturally safe and accessible workplace where dignity, trust, respect, and the promotion of diversity and inclusion are valued, so you can safely bring your whole self to work and connect with your community through our many diverse employee networks.\n\n\nIf you require an adjustment in the recruitment process, please contact our Talent Acquisition Advisor listed below.\n\n\nA career of life-changing impact awaits you. Apply now! \n\n\nApplications close: Sunday 26 May at 11.55pm\n\n\nTo apply for this role, click on 'apply now' and provide:\n\n\n\n\nYour current resume\n\n\nResponse to one targeted question below when prompted within the application process (300 words)\n\n\n\n\nTargeted Question:\n The Senior Client Application Engineer role involves working with multiple platforms to deliver applications and configurations to end user devices at TAFE campuses across NSW. Describe your experience with managing end user applications for various device types (Windows, Mac, mobile) and demonstrate your ability to employ appropriate security controls to meet organisational security requirements. (300 words)\n\n\nRole-specific enquiries\n: Contact Stjepan Stanic, Manager Client Applications via email \n[email protected]\n\n\nGeneral recruitment and adjustment enquiries\n: contact Talent Acquisition Advisor, Sarah Aitchison via email \n[email protected]\n or call \n0435 078 206\n.\n\n\nFor helpful insights into preparing your application, TAFE NSW’s recruitment process, and getting interview ready, read through our \nApplication Process\n and the interactive \nCapability Application Tool\n.  \n\n\nThis is a child-related position. \nA Working with Children Check\n is a prerequisite for anyone in child-related work. It involves a national criminal history check and review of findings of workplace misconduct. \n\n\nFor ongoing positions in the NSW Public Sector, you need to be an Australian Citizen or Permanent Resident of Australia or a New Zealand citizen with a current New Zealand passport.\n\n\nAn eligibility list, valid for 18 months, may be created for this position, and position(s) of the same classification that subsequently becomes vacant, may be filled via this eligibility list. \n\n\nLocation is negotiable across our \nTAFE NSW campuses\n. Please note your preferred campus location is not guaranteed and is subject to campus availability at the time of offer.",
    "id": 75574172,
    "listingDate": "2024-05-03T02:17:03Z",
    "location": "Southern Highlands & Tablelands",
    "title": "Senior Client Applications Engineer",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75558161/apply",
    "description": "How did you think you’d make your living growing up? \n The term 'DevOps' didn't exist.\n But I bet you didn’t aspire to work in a government office in Canberra. Building platforms for taxation. Superannuation. Or the births deaths and marriages registry, did you? \n  \n You probably thought about making a product that makes a difference. Work that meant something. So how about you help tackle the cost of living crisis in Australia, whilst supporting a move to green energy? \n  \n You’d join a team of 30, with around 10 tech specialists ranging from data, developers, embedded software and electronics engineers.\n They’re taking a world-first approach to solar energy. Creating a platform that allows its users to trade energy through a sophisticated system of remote networks and VPNs deployed, nationally. \n Sure anyone can put solar panels on their roof. But leveraging novel solar, battery and inverter technology. Combined with an intelligent networking platform. You can help make things… Well, a lot smarter. \n \nWhat you’ll be doing…\n  \n The platform is stable now. But with a capital raise planned this year to drive product sales there’s a lot to do across GCP, provisioning new services, migrating to Kubernetes and building better monitoring. \n  \n This is your chance to shape the networking and cloud infrastructure, server architecture and security compliance. There’s already a strong DevOps philosophy. So tools like Terraform, Crossplane, Docker, Postgres and Kafka are already there. \n  \n The advantage of doing this early on in a small business is things will move quickly. You can access the knowledge you need to get into the weeds for provisioning new services. \n You’ll enjoy the flexible hours and option to work from home 4 days a week. If you drive an electric car, you can charge it at work for free. In the summer months, you can enjoy the additional annual leave provided over the standard 20 days. \n \nWhat you’ll need… \n You’re the kind of person who enjoys diving deep into networking. We’ll also need you to bring experience in Linux, Python and Cloud Infrastructure. \n If you’re used to working in small, agile environments great. If you’re from a more corporate background and looking for less red tape, that’s fine too.\n To find out more and for an informal chat, get in touch with me at \n[email protected]\n / \n0406 158 832\n. \n \n Don’t worry about updating your CV just yet, we can worry about that later.",
    "id": 75558161,
    "listingDate": "2024-05-02T08:18:05Z",
    "location": "Canberra",
    "title": "GCP DevOps Engineer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75550303/apply",
    "description": "Location:\n Beard ACT\nAre you a skilled detailer with a strong engineering background and a passion for precision in structural design? If so, we have an exciting opportunity for you to join our dynamic team as a Frame and Truss Detailer. As a leader in Steel Frames and Trusses manufacturing, we are seeking a detail-oriented individual with hands-on experience in FRAMECAD software to contribute to our innovative projects.\nResponsibilities:\nCollaborate with architects, engineers, and project managers to create accurate and detailed designs for frame and truss systems.\nUtilize your expertise in FRAMECAD software to develop comprehensive structural plans, ensuring compliance with industry standards and regulations.\nInterpret architectural drawings and translate them into precise technical specifications for manufacturing and construction.\nIdentify potential design improvements and provide suggestions to optimize structural integrity, cost-efficiency, and construction timelines.\nCommunicate effectively with internal teams and external stakeholders to address design-related queries and concerns.\nRequirements:\nBachelor's degree in Structural Engineering, Civil Engineering or related field. Master's degree is a plus.\nProven experience working as a Frame and Truss Detailer, demonstrating a strong understanding of structural design principles.\nProficiency in using FRAMECAD software for detailed design and drafting.\nSolid knowledge of relevant codes, regulations, and standards related to frame and truss systems.\nExcellent problem-solving skills and the ability to think critically in order to optimize designs.\nStrong communication skills to collaborate effectively with cross-functional teams and clients.\nDetail-oriented mindset with a dedication to delivering accurate and error-free designs.\nAbility to manage multiple projects and priorities in a fast-paced environment.\nBenefits:\nCompetitive salary and benefits package.\nOpportunity to work with a diverse team of industry experts on cutting-edge projects.\nProfessional growth and development through ongoing training and learning opportunities.\nCollaborative and inclusive work environment that values innovation and creativity.\nChance to contribute to the success of impactful projects that shape the construction industry.\nIf you are a detail-driven individual with a passion for precision and a solid background in engineering, along with proven experience using FRAMECAD software, we encourage you to apply. Join us in creating exceptional designs that drive innovation and excellence in the Steel Frames and Trusses manufacturing field.\nHow to Apply:\nPlease submit your resume, a cover letter outlining your relevant experience, and a portfolio showcasing your FRAMECAD software projects. We look forward to reviewing your application and getting to know you better.\n \nENFRAME an equal opportunity employer. We encourage applications from candidates of all backgrounds and experiences.",
    "id": 75550303,
    "listingDate": "2024-05-02T04:07:20Z",
    "location": "Canberra",
    "title": "Steel Frames & Trusses Detailer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75540905/apply",
    "description": "Our Why\n \nDatacom works with organisations and communities across Australia and New Zealand to make a difference in people’s lives and help organisations use the power of tech to innovate and grow. \nThe Nuts and Bolts\nWe have over 6,500 people across our global offices, and generate an annual revenue of over $1.49 billion, this makes us one of Australasia's largest professional IT services companies. We have extensive expertise in operating data centres, providing IT services, software engineering and application management, as well as payroll and customer service design and operations. With this comes a long list of significant clients Datacom is committed to hiring, developing and promoting the best talent from a diverse range of backgrounds. We are local at heart, yet world-class in capability.\nOur Team\nDatacom Group Technology is responsible for the provision of company-wide technology services which are critical to the business because they:\n \nSupport business processes that through their efficiency (speed, accuracy, and cost per transaction) give the organization a competitive edge.\n \nDeliver an end user experience that supports enhanced employee engagement and productivity.\n \nAllow the business to scale without incurring corresponding increases in cost.\n \nSupport business growth through diversification of service offerings.\n \nAbout the role\nThe Systems Engineer role is responsible for supporting Datacom's technical infrastructure including corporate hardware and software as well as providing corporate systems for the Datacom Business. The Systems Engineer primarily performs support activities in our corporate Production Environment, including responsibility for infrastructure changes following formal change control process. This role will also assist with Priority incidents and internal projects as opportunities present themselves.\nThe Systems Engineer position would suit someone keen to take the next step in their career. We're after people who exude common sense and professionalism, are team players, can work under pressure with minimum supervision and who can demonstrate exceptional problem-solving abilities and a passion for learning.\nPlease note this is a 6 month fixed term position \nWhat you'll bring\nAs an experienced professional, you'll be a success-driven and naturally passionate about technology, using it to deliver great customer outcomes. You will be comfortable engaging with and supporting all levels of customers from technical staff through to executives and your attention to detail will ensure your deliverables are of the highest standards.\nIdeally, your Technical Skills will encompass some or all of the following:\n \nAdvanced Windows 10/11 troubleshooting experience\n \nBasic Windows server experience\n \nAll-rounder in Microsoft Products\n \nMicrosoft O365 Admin\n \nMicrosoft Intune\n \nMicrosoft Security/ Defender, MFA\n \nAzure / Azure AD\n \nActive Directory, DNS, DHCP, Group Policy\n \nExchange Online and on-premises\n \nRemote access, VPN, LAN, Wireless\n \nExperience with SCCM/ BigFix\n \nMeeting Room technologies e.g. AV equipment\n \nAbility to work on problems of diverse scope\n \nMin of 3+ years experience in a similar role and environment\n \nWhy Datacom?\nDatacom is one of Australia and New Zealand’s largest suppliers of Information Technology professional services. We have managed to maintain a dynamic, agile, small business feel that is often diluted in larger organisations of our size. It's our people that give Datacom its unique culture and energy that you can feel from the moment you meet with us. \nWe care about our people and provide a range of perks such as social events, chill-out spaces, remote working, flexi-hours and professional development courses to name a few. You’ll have the opportunity to learn, develop your career, connect and bring your true self to work. You will be recognised and valued for your contributions and be able to do your work in a collegial, flat-structured environment. We operate at the forefront of technology to help Australia and New Zealand’s largest enterprise organisations explore possibilities and solve their greatest challenges, so you will never run out of interesting new challenges and opportunities. We want Datacom to be an inclusive and welcoming workplace for everyone and take pride in the steps we have taken and continue to take to make our environment fun and friendly, and our people feel supported. \nIf you would like to know more and this sounds like you. Please apply online today!",
    "id": 75540905,
    "listingDate": "2024-05-01T21:22:21Z",
    "location": "Canberra",
    "title": "Systems Engineer | Fixed Term - Canberra",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75530725/apply",
    "description": "Murrays Coaches are looking for a motivated individual to join our IT team in a flexible role as full-stack .Net Developer.\nAs a developer you will work with a small, distributed development team on maintenance tasks, BAU and other small projects. You will also support the IT team by providing frontline technical and administrative support to staff and troubleshooting minor issues.\nIn this position you will:\nWork with the development team on small and large projects\nUndertake small projects independently\nWork with stakeholders to gather requirements and translate them into specifications\nAssist with routine web development and content creation\nWork with Azure DevOps\nAnswer notes, phone calls and emails from staff\nProvide a basic level of technical support to staff for software and hardware related problems\nTroubleshoot and resolve minor IT issues\nAssist the IT team with server-side support\nComplete administrative level support duties (e.g. account resets)\nDesired skills:\nc# .net,.net core Development\nhtml5, css, javascript\nASP.NET razor pages, MVC and Webforms\nGood knowledge of T-SQL\nUmbraco/CMS content creation\nBasic knowledge of web and code optimisation, including SEO, or using Resharper to write efficient code\nSolid understanding of common software development standards, processes and methodologies\nConfidence in dealing with both the latest Microsoft technologies and supporting legacy applications.\nAzure exposure\nAbout you:\nExcellent interpersonal and communication skills\nProven experience of talking to stakeholders from non-technical backgrounds\nIf not based in Canberra, must be prepared to travel once a month to attend face to face team meetings (travel expenses covered).\nCapability to work on small tasks without supervision\nCapability to work effectively within a distributed team\nHas proven continuity in their professional life, as opposed to \"lots of qualifications\"\nYou are typically an outgoing person and happy to communicate with people, yet you keep it short and concise\nBenefits:\nCompetitive pay based on experience\nWorking within a small, distributed team of nice people, we don’t play politics\nFlexible role with a mix of independent work, project involvement, and support responsibilities.\nOur Employee Assistance Program is available to you and all your family members and offers free professional counselling services for a range of issues including physical and mental health, financial services, work life balance and much more\nLearning resources such as Pluralsight and paid training courses\nAbout Murrays:\nMurrays Coaches are a family-owned business operating since 1966. We provide ground transport to peak sporting bodies and teams, event companies, schools and corporate customers, as well we operate regular express services in QLD, NSW & the ACT.\nHow to apply:\nTo be considered for this role, please submit your resume and a cover letter outlining your relevant experience to \n[email protected]\n.\nOnly shortlisted candidates will be contacted. No recruitment agencies please. Previous applicants need not apply. \nApplicants must be an Australian or New Zealand citizen or an Australian permanent resident.",
    "id": 75530725,
    "listingDate": "2024-05-01T03:47:56Z",
    "location": "Canberra",
    "title": "C# .Net Developer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75472797/apply",
    "description": "Why MTP Services?\n \nWe are an independent tech consultancy putting people at the heart of technology to help advance the way we work, enhance the way we live, and plan for a brighter tomorrow. At MTP Services, we cherish sparks over cogs, aiming to provide an environment where every individual can shine in their unique way. With a mantra that believes in the flexibility and uniqueness of each team member, we're not just another consultancy; we're a place where your career is in your hands, supported by a vast network of professionals and exciting, impactful projects.\n \nRole Summary\n \nAs a full stack developer, you will play a pivotal role in the full lifecycle of our software applications’ development. This role encourages ownership and initiative, as you engage in designing robust front-end interfaces and constructing resilient backend systems. With a focus on technical decision-making and architectural contributions, this position is ideal for someone with a solid foundation in computer science and a desire to apply their seasoned skills in web development, database management, and modern development practices. Advanced certifications and a proven history of professional growth will be highly regarded as you advance with our innovative tech team.\n \nKey Responsibilities\n \n \nDevelop, deploy, and optimise front-end and back-end code for high-traffic applications.\n \nLead collaborative efforts with the development team to produce and maintain scalable user interfaces, with an emphasis on user engagement and experience.\n \nManage database operations, ensuring robustness and efficiency in data handling and storage.\n \nTranslate complex business requirements into scalable technical solutions with meticulous attention to detail.\n \nDrive the integration of sophisticated front-end UIs with back-end services, optimising for performance and scalability.\n \nUphold and advocate for high coding standards, contributing to code reviews and the mentoring of junior developers.\n \nProactively stay abreast of, and implement, emerging development tools and technologies.\n \nTroubleshoot effectively, identifying, and rectifying defects to enhance software reliability and lead problem-solving efforts.\n \n \nQualifications\n \n \nA tertiary degree in Computer Science, Software Engineering, or a related field is preferred.\n \n3-5 years of hands-on experience in full stack development.\n \nA comprehensive understanding of web development and design principles across multiple platforms.\n \nProficiency in managing and utilising database systems, including both SQL and NoSQL options.\n \nWell-versed in API design and development, with a history of integrating complex systems.\n \n \nWe Offer\n \n \nAs role where you're encouraged to be your best, supported by above-average salaries and truly insane perks.\n \nA culture that values flexibility, growth, and personal achievement over rigid structures.\n \nAn environment that’s anything but ordinary, where your work is about making a real impact.",
    "id": 75472797,
    "listingDate": "2024-04-29T06:48:59Z",
    "location": "Canberra",
    "title": "Full Stack Developer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75472599/apply",
    "description": "Why MTP Services?\nWe are an independent tech consultancy putting people at the heart of technology to help advance the way we work, enhance the way we live, and plan for a brighter tomorrow. At MTP Services, we cherish sparks over cogs, aiming to provide an environment where every individual can shine in their unique way. With a mantra that believes in the flexibility and uniqueness of each team member, we're not just another consultancy; we're a place where your career is in your hands, supported by a vast network of professionals and exciting, impactful projects.\n \nRole Summary\n \nAs a junior full stack developer, you will contribute to developing both the front-end and back-end of our software applications. You will be part of a team that values collaboration and learning, assisting in the creation of intuitive user interfaces and supporting backend systems. With a focus on growth, you will help in maintaining data consistency and implementing technical requirements into functional software. This role is designed for someone who is keen to apply their foundational computer science education and who is eager to expand their knowledge of web development, databases, and modern development practices. Certifications and a drive to learn will be a plus, as you evolve with our dynamic tech environment.\n \nKey Responsibilities\n \n \nAssist in developing and implementing both front-end and back-end code for new or existing applications.\n \nCollaborate with the development team to design user interfaces that are intuitive and provide a positive user experience.\n \nSupport the maintenance of databases and ensure data consistency throughout applications.\n \nParticipate in the translation of business requirements into technical designs under the guidance of senior staff.\n \nIntegrate frontend applications with backend services.\n \nHelp adhere to coding standards and participate in code review sessions to ensure best practices and quality.\n \nKeep up to date with emerging development tools and technologies, applying learned concepts to daily work.\n \nProvide support in troubleshooting and resolving defects reported in the software.\n \n \nQualifications\n \n \nBachelor’s degree in computer science, Software Engineering, or a related field is preferred.\n \nSome experience or knowledge in full stack development practices.\n \nBasic understanding of web development, including HTML5, CSS3, and general web design principles.\n \nExposure to database systems\n \nFamiliarity with the concepts of API interaction\n \n \nWe Offer\n \n \nAs role where you're encouraged to be your best, supported by above-average salaries and truly insane perks.\n \nA culture that values flexibility, growth, and personal achievement over rigid structures.\n \nAn environment that’s anything but ordinary, where your work is about making a real impact.",
    "id": 75472599,
    "listingDate": "2024-04-29T06:43:34Z",
    "location": "Canberra",
    "title": "Junior Full Stack Developer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75470161/apply",
    "description": "Job Title: Civil & Hydraulic Engineer\nCompany Overview:\n \nInvolved in various Civil & Construction Works throughout NSW and ACT, Civil & Civic has a range of upcoming projects. Our Senior Management Team boast over 20 years of construction experience, and our employees have been hand-picked to integrate a range of specialist knowledge and skills to complement each project we undertake.\nPosition Overview:\n \nWe are seeking a highly skilled Civil Engineer to join our team. The ideal candidate will have a strong background in both civil engineering, with a passion for designing and implementing innovative solutions to complex challenges. This role offers the opportunity to work on a diverse range of projects, from infrastructure development to water resource management.\nResponsibilities:\nCollaborate with multidisciplinary teams to develop comprehensive engineering designs and solutions.\nConduct site assessments and surveys to gather data and assess project feasibility.\nDesign and analyse hydraulic systems, including pipelines, stormwater management systems, and irrigation networks.\nPrepare detailed engineering plans, drawings, and specifications using industry-standard software.\nPerform hydraulic calculations and simulations to optimize system performance and efficiency.\nEnsure compliance with regulatory standards and guidelines throughout the project lifecycle.\nProvide technical expertise and support during construction and commissioning phases.\nParticipate in project meetings, presentations, and client interactions to communicate progress and address concerns.\nQualifications:\nBachelor’s degree in Civil Engineering, Hydraulic Engineering, or a related field. Master’s degree preferred.\nProficiency in engineering design software such as AutoCAD, Civil 3D, and HEC-RAS.\nStrong analytical skills with the ability to solve complex problems and optimize designs.\nExcellent communication skills, both verbal and written, with the ability to effectively collaborate with colleagues and clients.\nKnowledge of relevant industry standards, regulations, and best practices.\nBenefits:\nCompetitive salary commensurate with experience.\nComprehensive benefits package, including health insurance, retirement plans, and paid time off.\nProfessional development opportunities to expand your skills and advance your career.\nDynamic work environment with opportunities for growth and leadership.\nHow to Apply:\n If you are passionate about engineering excellence and eager to contribute to impactful projects, we invite you to apply for this exciting opportunity. Please submit your resume and cover letter outlining your qualifications and relevant experience to [email address]. Be sure to include “Civil & Hydraulic Engineer” in the subject line of your email. We look forward to hearing from you!",
    "id": 75470161,
    "listingDate": "2024-04-29T05:59:33Z",
    "location": "Canberra",
    "title": "Civil  Engineer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75464450/apply",
    "description": "Job Title: Civil & Hydraulic Engineer\nCompany Overview:\n \nInvolved in various Civil & Construction Works throughout NSW and ACT, Civil & Civic has a range of upcoming projects. Our Senior Management Team boast over 20 years of construction experience, and our employees have been hand-picked to integrate a range of specialist knowledge and skills to complement each project we undertake.\nPosition Overview:\n \nWe are seeking a highly skilled Civil & Hydraulic Engineer to join our team. The ideal candidate will have a strong background in both civil and hydraulic engineering, with a passion for designing and implementing innovative solutions to complex challenges. This role offers the opportunity to work on a diverse range of projects, from infrastructure development to water resource management.\nResponsibilities:\nCollaborate with multidisciplinary teams to develop comprehensive engineering designs and solutions.\nConduct site assessments and surveys to gather data and assess project feasibility.\nDesign and analyse hydraulic systems, including pipelines, stormwater management systems, and irrigation networks.\nPrepare detailed engineering plans, drawings, and specifications using industry-standard software.\nPerform hydraulic calculations and simulations to optimize system performance and efficiency.\nEnsure compliance with regulatory standards and guidelines throughout the project lifecycle.\nProvide technical expertise and support during construction and commissioning phases.\nParticipate in project meetings, presentations, and client interactions to communicate progress and address concerns.\nQualifications:\nBachelor’s degree in Civil Engineering, Hydraulic Engineering, or a related field. Master’s degree preferred.\nProficiency in engineering design software such as AutoCAD, Civil 3D, and HEC-RAS.\nStrong analytical skills with the ability to solve complex problems and optimize designs.\nExcellent communication skills, both verbal and written, with the ability to effectively collaborate with colleagues and clients.\nKnowledge of relevant industry standards, regulations, and best practices.\nBenefits:\nCompetitive salary commensurate with experience.\nComprehensive benefits package, including health insurance, retirement plans, and paid time off.\nProfessional development opportunities to expand your skills and advance your career.\nDynamic work environment with opportunities for growth and leadership.\nHow to Apply:\n If you are passionate about engineering excellence and eager to contribute to impactful projects, we invite you to apply for this exciting opportunity. Please submit your resume and cover letter outlining your qualifications and relevant experience to [email address]. Be sure to include “Civil & Hydraulic Engineer” in the subject line of your email. We look forward to hearing from you!",
    "id": 75464450,
    "listingDate": "2024-04-29T03:21:25Z",
    "location": "Canberra",
    "title": "Hydraulic Engineer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75460358/apply",
    "description": "Offering a full-time, ongoing position\n\n\nAccess to our state-of-the-art technology to educate \n\n\nEmpower the next generation of learners \n\n\n\n\n \nAbout the Role\n \n\n\nThe School is currently seeking to appoint an innovative, collaborative, and passionate IT teacher to join the Digital Innovation Department. The successful candidate will possess not only exemplary teaching and communication skills but also a high level of technical proficiency in coding and programming. \n\n\nThe ideal candidate will possess advanced programming abilities, particularly in Python, Java, or JavaScript. Additionally, proficiency in algorithm design and computer science fundamentals is essential. Moreover, experience in utilizing IoT and machine learning technologies would be highly valued. \n\n\nWe are looking for an individual who is not only capable of delivering effective lessons but also enthusiastic about fostering a dynamic and engaging learning environment. If you believe you possess these qualities and are eager to contribute to our team, we encourage you to apply for this exciting opportunity. \n\n\n \nAbout You\n \n\n\nYou are dedicated, passionate and possess the following: \n\n\n\n\nExperience teaching IT in a similar teaching environment \n\n\nProven passion for the learning and holistic development of students in and beyond the classroom \n\n\nProven experience of modelling outstanding teaching practice in and beyond the classroom \n\n\nProven subject expertise and the ability to teach inclusively across a broad age and ability range \n\n\nProven commitment to collaborative professional engagement and professional learning \n\n\nExperience of, or willingness to train for, teaching the Australian Curriculum and, where relevant, the Higher School Certificate and/or the International Baccalaureate \n\n\nEnthusiastic commitment to participating in the School’s pastoral and co-curricular program  \n\n\nClear commitment to respecting the School’s Anglican ethos and spirit of inclusion \n\n\nFirm commitment to safeguarding and promoting the welfare of children \n\n\n\n\nAll team members at CGS are required to have: \n\n\n\n\nAppropriate qualifications \n\n\nA valid ACT Working with Vulnerable People Card \n\n\nA current National Police Check; and \n\n\nFull working rights within Australia.\n \n \n\n\n\n\nBenefits for you\n \n\n\nAs a CGS team member, you have access to a range of additional benefits, including: \n\n\n\n\nA highly competitive salary and superannuation of 12.5% (for permanent team members) \n\n\nStaff awards programme and generous professional development funding \n\n\nAttractive salary packaging arrangements \n\n\nComplimentary daily barista-made coffee  \n\n\nDelicious daily morning tea and discounted lunches \n\n\nAccess to the onsite health clinic and annual influenza vaccinations \n\n\n24/7 access to our Employee Assistance Programme \n\n\n14 weeks of paid parental leave \n\n\nSchool fee concessions \n\n\nFree parking \n\n\n\n\nWorking at CGS\n \n\n\nWe aim to provide a vibrant and rewarding workplace that showcases your skills with a strong commitment to your professional learning. Working at Canberra Grammar School you will join a community committed to delivering the highest standard of education, inspiring students to achieve personal excellence within a warm and inclusive environment. \n\n\nWe are continuously growing our CGS community with people who are passionate and energetic in their profession and who place student learning and well-being at the forefront of all they do. We invite candidates of all ages, people with a disability and Indigenous Australians to apply.  \n\n\nHow to Apply\n \n\n\nPlease click ‘Apply’ button and submit the following documents: \n\n\n\n\nCover letter (addressing the selection criteria on the Position Description) \n\n\nResume/CV \n\n\n\n\nCGS is proud to be a School that takes child protection very seriously. All candidates for roles at Canberra Grammar School are subject to screening and assessment against child safety standards as part of our thorough recruitment process. \n\n\nAn early application is advised as we reserve the right to close the vacancy early if sufficient suitable applications are received.",
    "id": 75460358,
    "listingDate": "2024-04-29T01:23:57Z",
    "location": "Canberra",
    "title": "Information Technology Teacher",
    "type": "manual"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75377921/apply",
    "description": "SOFTWARE ENGINEER\nABOUT GEOSCAPE AUSTRALIA\nGeoscape Australia is a leader in location intelligence. We are committed to building a smarter, more productive Australia by delivering data products and services that have impact on the everyday lives of Australian’s, by powering enterprise and enabling good government. Geoscape Australia is widely recognised as delivering economic, social and environmental outcomes across the economy, through its customer and partner ecosystem.\nABOUT THE ROLE\nThis is a key role within a development team to design, collaborate and execute the technical vision of Geoscape's Continuous Data Platform.\nThis exciting role is responsible for delivering technical solutions, contributing to the vision, and designing and developing frameworks and components which make up the continuous data platform. You’ll work with the team to execute on technical solutions driving product goals, and break down product features into actionable, deliverable items of work.\nStrong Technical and collaborative skills are essential to support both the success of the team and the company at large.\nWHO WE’RE LOOKING FOR\nA creative problem-solver with strong technical skills, and a desire to deliver the products our customers need.\nYou’ll bring:\nStrong technical design, engineering, and architecture skills\n3+ years of software development experience, with a preference for Python.\n2+ years of experience with AWS, Azure, or Google Cloud platform, with a preference for AWS \nWorking knowledge of Docker, IaC and CI/CD tools \nThe ability to grasp a problem, assess solutions and take action to implement them\nThe ability to communicate complex concepts in plain language.\nA willingness to own and operate the systems you’re building\nAn understanding and commitment to working in short cycles, pair programming and delivering product iteratively.\nThe desire to always learn new skills and techniques, and to share your knowledge with the team.\nThe ability to manage work with innovation time\nSKILLS\nWe look forward to you providing examples of your skills and experience in:\nDelivering solutions that meet customer needs\nImproving technical standards\nStrong communication skills, both verbal and written\nThe ability to work autonomously as well as part of a team. \nIt would be advantageous but not essential if you have experience with:\nBoth SQL and NoSQL\nGeospatial data \nWeb frontend implementation experience using ReactJS or similar\nMachine Learning\nTools We Use\nSome of the tools we use in our day-to-day work include:\nPython\nPostgreSQL/PostGIS\nPyCharm\nDocker\nAWS: RDS, Lambda, Kinesis, S3, ECS, DynamoDB\nGit, GitHub, Jira\n \nJOIN OUR TEAM OF INNOVATORS\nData was once an abstract idea. Today it’s woven through our lives, linking the physical and the digital, informing the choices we make in rapidly evolving social and geographical landscapes.\nGeoscape Australia is a trusted source of spatial data, and an independent and self-funded company owned by the governments of Australia.\nPromoting innovation is our cause. In the data-driven economy, our data powers new technologies, products and processes, improves productivity and stimulates economic growth.\nWith a history of collaboration and a culture of shared thinking, we push beyond what we know today to approach new challenges with a fresh perspective.\nThe result? For businesses and governments, the data required to make better decisions. For our people, the chance to build a meaningful career solving real-world problems.\n \nOUR VALUES\nWe’re passionate about building a smarter, more productive Australia and we put our people first in the decisions we make. Our teams are passionate about our products and have a genuine desire for the growth of not only Geoscape’s products but each other.\nWe have a transparent team of experienced Senior Leaders who channel clear expectations and goals with regular performance feedback and recognition.\nMost importantly we are a respectful, inclusive and friendly workplace and each of our team members proudly role model the company values; \nTrusted | Courageous | Inclusive\n \nBENEFITS\nFlexible working arrangements to support you to thrive at work and at home\nA commitment to professional development, including an annual professional development allowance\nRegular one on one check-ins with clear conversations on OKRs and real time feedback\nSalary sacrifice arrangements\nEmployee surveys and other feedback mechanisms\nHealthy workplace initiatives\nAn annual doona day\nAnd…we have fun!\n \nGeoscape Australia is an equal opportunity employer. We value diversity and are committed to creating an inclusive environment for all employees.\nIf this sounds like you, we'd love to hear from you.\n \nHOW TO APPLY\nApply using the apply here link in this job ad, please note only short listed candidates will be contacted.\nPlease no recruiters, we are happy to go this one alone.",
    "id": 75377921,
    "listingDate": "2024-04-24T05:14:00Z",
    "location": "Canberra",
    "title": "Software Engineer",
    "type": "auto"
  },
  {
    "applyLink": "https://www.seek.com.au/job/75345392/apply",
    "description": "We're on the lookout for talented Cloud Engineers\nWe are seeking skilled Cloud Engineers to work as part of our multidisciplinary teams delivering high-quality digital products and solutions to our diverse range of clients. While permanent team members sit at the top of our preferences, contractors are also highly encouraged to apply. \nWe welcome those who have experience in related roles.\nKey Responsibilities\nDemonstrate the ability to identify and track Key Performance Indicators (KPIs) for applications and infrastructure and provide timely alerts upon any fluctuations or deviations. \nSuccessfully design, develop, and maintain automation pipelines contributing to effective continuous integration and continuous deployment (CI/CD) practices. \nProactively escalate, respond to, and resolve incidents, showing initiative, and minimising system downtime and disruption, reinforcing a culture of open and honest collaboration. \nShow proficiency in designing, developing, and maintaining cloud infrastructure templates in accordance with client requirements, and ensuring their seamless deployment and maintenance. \nUphold security best practices, ensuring full compliance with industry standards, regulations, and client IT Security Advisers' policies, enhancing the security posture of the projects. \nFoster an environment of agile teamwork and shared problem-solving, collaborating regularly with team members to meet project, client, and sprint goals. \nEmbrace learning and development opportunities by acquiring new technical skills and methodologies, demonstrating the ability to contribute innovative solutions to system challenges and blockers. \nAdhere to set deadlines and ensure open, honest, and transparent communication with the team when faced with blockers or challenges, promoting the timely resolution of issues. \nChampion the dismantling of silos and fostering collaboration and communication within teams, thereby improving cross-functional teamwork and the overall work environment. \n \nWho We Are:\nAt GoSource, we are a world-class digital services company that combines innovation and technical excellence to deliver remarkable outcomes. \nOur leaders are recognised globally as thought leaders, and leaders of high-performing teams on award-winning projects. Our teams are made up of exceptional individuals who are great at what they do and enjoy working together to create meaningful change. \nWhat we do: \nGoSource makes exciting innovative digital products, working with modern technologies, pioneering experimental stacks and deploying future-focused design thinking tools. \nWe have delivered and continue to work on projects of national and international significance. Our impactful work delivers outcomes that can make a real difference in the world. \nWhy GoSource?\nOur people are at the heart of what we do. We nurture talent by investing in our people, ensuring that each person thrives within our powerhouse multidisciplinary teams. \nWe offer flexible work arrangements like working from home and part-time schedules, embracing a work-life balance that fuels both personal growth and professional excellence.\nNext Steps:\nApply Online: If this sounds like you, click ‘quick apply’. By doing so, you’re consenting to our retention of your details for future potential role considerations.\nIf you have any further questions, please connect with us at: \n[email protected]\n.\nAt GoSource, skills and capability speak louder than labels. We're here for your talent and the unique perspective you bring to the team.\nCheck out our website at https://gosource.com.au",
    "id": 75345392,
    "listingDate": "2024-04-23T04:42:01Z",
    "location": "Canberra",
    "title": "Cloud Engineer",
    "type": "auto"
  }
]
